stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
/**
  ******************************************************************************
  * @file    sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
  * @brief   User GAP and GATT (not related to Sidewalk operation) handling
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <assert.h>

#include "sid_pal_ble_adapter_stm32wba.h"
#include "sid_pal_ble_adapter_stm32wba_config.h"
#include "sid_pal_ble_adapter_stm32wba_ext_ifc.h"
#include "sid_pal_ble_adapter_stm32wba_private_defs.h"
#include "sid_pal_ble_adapter_stm32wba_user_gap_gatt.h"
#include "sid_pal_ble_adapter_stm32wba_utils.h"

/* Sidewalk interfaces */
#include <sid_pal_assert_ifc.h>
#include <sid_pal_critical_region_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_pal_storage_kv_ifc.h>

/* BLE stack */
#include <ble_core.h>
#include <ble_types.h>
#include <ll_sys_if.h>

/* Utils */
#include "stm32_rtos.h"
#include <flash_driver.h>
#include <flash_manager.h>
#include <sid_stm32_common_utils.h>
#include <stm_list.h>

/* Private defines -----------------------------------------------------------*/

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_NONE) || (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID)
#  error "User-defined BLE profiles are not supported by the current config. Please exclude this file from build"
#endif

/* Private macro -------------------------------------------------------------*/

#ifndef SID_BLE_USER_EXTRA_LOGGING
/* Set SID_BLE_USER_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_BLE_USER_EXTRA_LOGGING (0)
#endif

#if SID_BLE_USER_EXTRA_LOGGING
#  define SID_BLE_USER_LOG_ERROR(...)         SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_BLE_USER_LOG_WARNING(...)       SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_BLE_USER_LOG_INFO(...)          SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_BLE_USER_LOG_DEBUG(...)         SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_BLE_USER_LOG_TRACE(...)         SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_BLE_USER_LOG_ERROR(...)         ((void)0u)
#  define SID_BLE_USER_LOG_WARNING(...)       ((void)0u)
#  define SID_BLE_USER_LOG_INFO(...)          ((void)0u)
#  define SID_BLE_USER_LOG_DEBUG(...)         ((void)0u)
#  define SID_BLE_USER_LOG_TRACE(...)         ((void)0u)
#endif

#ifndef containerof
#  define containerof(ptr, type, member)      ((type *)((uintptr_t)(ptr) - offsetof(type, member)))
#endif

/* Private typedef -----------------------------------------------------------*/

typedef struct {
    tListNode node;
    sid_ble_ext_virtual_device_ctx_t * ctx;
} sid_ble_ext_virtual_device_node_t;
static_assert(offsetof(sid_ble_ext_virtual_device_node_t, node) == 0u);

/* Private variables ---------------------------------------------------------*/

static sid_pal_ble_user_mode_ctx_t       sid_ble_user_mode_ctx = {0};
static sid_ble_ext_virtual_device_node_t active_virt_devs_list;

/* Flash access management */
static osSemaphoreId_t     ble_adapter_user_fm_semaphore = NULL;
static FM_CallbackNode_t   ble_adapter_user_fm_callback_node;
static FM_FlashOp_Status_t ble_adapter_user_last_fm_status;

/* Private constants ---------------------------------------------------------*/

/**
 * @brief Generic definition of a CCCD
 */
static const sid_ble_ext_char_desc_t cccd_def = {
    .desc_name         = "CCCD",
    .uuid = {
        .type          = UUID_TYPE_16,
        .uu            = {0x29u, 0x02u},
    },
    .max_length        = SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_SIZE,
    .access = {
        .read          = TRUE,
        .write_wo_resp = TRUE,
    },
};

static const osSemaphoreAttr_t ble_adapter_user_fm_semaphore_attributes = {
    .name      = "User BLE FM Semaphore",
    .attr_bits = SEMAPHORE_DEFAULT_ATTR_BITS,
    .cb_mem    = SEMAPHORE_DEFAULT_CB_MEM,
    .cb_size   = SEMAPHORE_DEFAULT_CB_SIZE,
};

/* Private function prototypes -----------------------------------------------*/

static        void                                 _ble_adapter_user_fm_callback(FM_FlashOp_Status_t Status);
static inline uint32_t                             _ble_adapter_user_acquire_ll_lock(const char * const error_msg);
static inline sid_error_t                          _ble_adapter_user_release_ll_lock(const uint32_t ll_lock_acquired ,const char * const error_msg);
static inline uint32_t                             _ble_adapter_user_is_desc_cccd(const sid_ble_ext_gatt_server_char_desc_ctx_t * const desc_ctx);
static inline uint16_t                             _ble_adapter_user_get_storage_kv_bond_pair_key(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint16_t slot_id);
static        sid_error_t                          _ble_adapter_user_search_bond_pair_kv_record(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t peer_identity_addr_type, const uint8_t peer_identity[SID_STM32_BLE_ADDRESS_LENGTH], uint16_t * const out_slot_id);
static inline uint32_t                             _ble_adapter_user_are_uuids_equal(const sid_ble_cfg_uuid_info_t * const uuid_a, const sid_ble_cfg_uuid_info_t * const uuid_b);
static inline const sid_ble_ext_virtual_device_t * _ble_adapter_user_search_device_definition(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static inline sid_ble_ext_virtual_device_node_t *  _ble_adapter_user_search_device_node(const sid_ble_ext_virtual_device_id_t virt_dev_id);
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0u)
static inline sid_ble_ext_virtual_device_node_t *  _ble_adapter_user_search_first_node_by_type(const sid_ble_ext_virtual_device_role_t device_type);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
static inline sid_ble_ext_virtual_device_node_t *  _ble_adapter_user_search_device_node_by_conn_handle(const uint16_t conn_handle);
static inline sid_ble_ext_conn_list_node_t *       _ble_adapter_user_search_connection_node_by_conn_handle(const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const uint16_t conn_handle);
static inline void                                 _ble_adapter_user_search_att_ctx_by_handle(sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** out_char_ctx, sid_ble_ext_gatt_server_char_desc_ctx_t ** const out_desc_ctx,
                                                                                              const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const uint16_t att_handle);
static inline void                                 _ble_adapter_user_search_char_ctx_by_uuid(const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const sid_ble_cfg_uuid_info_t * const char_uuid, sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** out_char_ctx);
static        uint32_t                             _ble_adapter_user_check_device_requires_pairing(const sid_ble_ext_virtual_device_t * const device_cfg);
static inline sid_error_t                          _ble_adapter_user_set_adv_params(const sid_ble_ext_virtual_device_ctx_t * const device_ctx, const uint32_t adv_interval_min, const uint32_t adv_interval_max);
static        sid_error_t                          _ble_adapter_user_init_advertising_settings(sid_ble_ext_virtual_device_ctx_t * const node_ctx, const sid_ble_ext_adv_param_t * const adv_param);
static        sid_error_t                          _ble_adapter_user_init_peripheral_gatt_char_descriptor(sid_ble_ext_gatt_server_char_desc_ctx_t * const out_desc_ctx, const uint16_t service_handle, const uint16_t char_handle, const sid_ble_ext_char_desc_t * const desc_def, const uint16_t max_att_mtu);
static        sid_error_t                          _ble_adapter_user_init_peripheral_gatt_characteristic(sid_ble_ext_gatt_server_char_ctx_t * const out_char_ctx, const uint16_t service_handle, const sid_ble_ext_char_def_t * const char_def, const uint16_t max_att_mtu);
static        sid_error_t                          _ble_adapter_user_init_peripheral_gatt_service(sid_ble_ext_gatt_server_svc_ctx_t * const svc_ctxs, const sid_ble_ext_gatt_svc_def_t * const svc_definition, const uint16_t max_att_mtu);
static        sid_error_t                          _ble_adapter_user_init_peripheral_gatt_services(sid_ble_ext_virtual_device_ctx_t * const node_ctx, const sid_ble_ext_gatt_profile_def_t * const gatt_profile);
static        sid_error_t                          _ble_adapter_user_init_peripheral(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_init_broadcaster(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_init_central(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_init_observer(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_deinit_peripheral(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_deinit_broadcaster(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_deinit_central(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_deinit_observer(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_terminate_device_node(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_set_node_adv_data(sid_ble_ext_virtual_device_node_t * const node, const uint8_t * const raw_data, const uint32_t raw_data_length);
static        sid_error_t                          _ble_adapter_user_set_node_scan_resp_data(sid_ble_ext_virtual_device_node_t * const node, const uint8_t * const raw_data, const uint32_t raw_data_length);
static        sid_error_t                          _ble_adapter_user_node_start_advertisement(sid_ble_ext_virtual_device_node_t * const node, const sid_ble_ext_adv_param_t * const adv_param);
static        sid_error_t                          _ble_adapter_user_node_stop_advertisement(sid_ble_ext_virtual_device_node_t * const node);
static        sid_error_t                          _ble_adapter_user_node_disconnect(sid_ble_ext_virtual_device_node_t * const node, sid_ble_ext_conn_list_node_t * const conn_node);

static        SVCCTL_EvtAckStatus_t                _ble_adapter_user_gatt_event_handler(void * p_Event);
static inline SVCCTL_EvtAckStatus_t                _ble_adapter_user_process_gatt_attr_rw_permit_req(const uint16_t conn_handle, const uint16_t att_handle, uint8_t * const out_att_status_code, const sid_ble_ext_att_access_type_t access_mode, const uint32_t full_data_length,
                                                                                                     sid_ble_ext_virtual_device_node_t ** const out_dev_node ,sid_ble_ext_conn_list_node_t ** const out_conn_node,
                                                                                                     sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** const out_char_ctx, sid_ble_ext_gatt_server_char_desc_ctx_t ** const out_desc_ctx);
static inline SVCCTL_EvtAckStatus_t                _ble_adapter_user_process_gatt_attr_modified_evt(const aci_gatt_attribute_modified_event_rp0 * const evt);
#if SID_STM32_BLE_DLE_ENABLE
static inline SVCCTL_EvtAckStatus_t                _ble_adapter_user_process_hci_le_meta_evt(const evt_le_meta_event * const evt);
#endif /* SID_STM32_BLE_DLE_ENABLE */

