stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
static        sid_error_t                          _ble_adapter_user_init(void);
static        sid_error_t                          _ble_adapter_user_deinit(void);
static        sid_error_t                          _ble_adapter_user_factory_reset(void);
static        sid_error_t                          _ble_adapter_user_virt_dev_activate(const sid_ble_ext_virtual_device_id_t virt_dev_id, sid_ble_ext_virtual_device_ctx_t * * const out_ctx);
static        sid_error_t                          _ble_adapter_user_virt_dev_terminate(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_set_adv_data(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t * const adv_data, const uint32_t adv_data_length);
static        sid_error_t                          _ble_adapter_user_virt_dev_set_scan_resp_data(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t * const scan_resp_data, const uint32_t scan_resp_data_length);
static        sid_error_t                          _ble_adapter_user_virt_dev_adv_start(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_adv_stop(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_get_bonded_peers(const sid_ble_ext_virtual_device_id_t virt_dev_id, sid_pal_ble_ext_peer_identity_addr_t * const out_bonded_peers_list, uint32_t * const out_bonded_peers_count, const uint32_t bonded_peers_list_size_limit);
static        sid_error_t                          _ble_adapter_user_virt_dev_remove_bond(const sid_ble_ext_virtual_device_id_t virt_dev_id, const sid_pal_ble_ext_peer_identity_addr_t * const peer_identity);
static        sid_error_t                          _ble_adapter_user_virt_dev_disconnect(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint16_t conn_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_disconnect_all(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_suspend(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_resume(const sid_ble_ext_virtual_device_id_t virt_dev_id);
static        sid_error_t                          _ble_adapter_user_virt_dev_update_char(const sid_ble_ext_virtual_device_id_t virt_dev_id, const sid_ble_cfg_uuid_info_t * const char_uuid, const uint8_t * const data, const uint32_t data_length, uint8_t notify);

/* Private constants ---------------------------------------------------------*/

#if (SID_STM32_BLE_COEXISTENCE_MODE != SID_STM32_BLE_COEXISTENCE_MODE_NONE) && (SID_STM32_BLE_COEXISTENCE_MODE != SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID)
static const sid_pal_ble_adapter_extended_interface_t user_ble_ifc = {
    /* Global Initialization and Maintenance */
    .init                           = _ble_adapter_user_init,
    .deinit                         = _ble_adapter_user_deinit,
    .factory_reset                  = _ble_adapter_user_factory_reset,

    /* Per-Device Initialization and Maintenance */
    .virtual_dev_activate           = _ble_adapter_user_virt_dev_activate,
    .virtual_dev_terminate          = _ble_adapter_user_virt_dev_terminate,
    .virtual_dev_suspend            = _ble_adapter_user_virt_dev_suspend,
    .virtual_dev_resume             = _ble_adapter_user_virt_dev_resume,

    /* BLE Advertising Management (for Peripherals and Broadcasters) */
    .virtual_dev_set_adv_data       = _ble_adapter_user_virt_dev_set_adv_data,
    .virtual_dev_set_scan_resp_data = _ble_adapter_user_virt_dev_set_scan_resp_data,
    .virtual_dev_adv_start          = _ble_adapter_user_virt_dev_adv_start,
    .virtual_dev_adv_stop           = _ble_adapter_user_virt_dev_adv_stop,

    /* BLE Per-Device Connection Management */
    .virtual_dev_get_bonded_peers   = _ble_adapter_user_virt_dev_get_bonded_peers,
    .virtual_dev_remove_bond        = _ble_adapter_user_virt_dev_remove_bond,
    .virtual_dev_disconnect         = _ble_adapter_user_virt_dev_disconnect,
    .virtual_dev_disconnect_all     = _ble_adapter_user_virt_dev_disconnect_all,

    /* BLE Peripheral Management */
    .virtual_dev_update_char        = _ble_adapter_user_virt_dev_update_char,
};
#endif /* SID_STM32_BLE_COEXISTENCE_MODE */

/* Imported variables --------------------------------------------------------*/

extern sid_pal_ble_adapter_ctx_t sid_ble_drv_ctx;

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void _ble_adapter_user_fm_callback(FM_FlashOp_Status_t Status)
{
	ble_adapter_user_last_fm_status = Status;
    SID_PAL_ASSERT(ble_adapter_user_fm_semaphore != NULL);
    (void)osSemaphoreRelease(ble_adapter_user_fm_semaphore);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _ble_adapter_user_acquire_ll_lock(const char * const error_msg)
{
    osStatus_t os_status;
    uint32_t   ll_lock_acquired;

    if (LinkLayerMutex != NULL)
    {
        /* Wait for any potentially ongoing BLE operations to stop */
        os_status = osMutexAcquire(LinkLayerMutex, SID_STM32_BLE_LL_MUTEX_WAIT_TIMEOUT_ON_INIT_TICKS);

        /* Print out warning but proceed */
        if (os_status != osOK)
        {
            SID_PAL_LOG_WARNING(error_msg);
            ll_lock_acquired = FALSE;
        }
        else
        {
            ll_lock_acquired = TRUE;
        }
    }
    else
    {
        /* This is the very first initialization, the mutex is not created yet */
        ll_lock_acquired = FALSE;
    }

    return ll_lock_acquired;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _ble_adapter_user_release_ll_lock(const uint32_t ll_lock_acquired ,const char * const error_msg)
{
    sid_error_t err;
    osStatus_t os_status;

    if ((ll_lock_acquired != FALSE) && (LinkLayerMutex != NULL))
    {
        os_status = osMutexRelease(LinkLayerMutex);
        if (os_status != osOK)
        {
            SID_PAL_LOG_ERROR(error_msg);
            err = SID_ERROR_UNRECOVERABLE;
        }
        else
        {
            err = SID_ERROR_NONE;
        }
    }
    else
    {
        err = SID_ERROR_NONE;
    }

