stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _ble_adapter_user_is_desc_cccd(const sid_ble_ext_gatt_server_char_desc_ctx_t * const desc_ctx)
{
    uint32_t ret;

    /* Simple check if the desciptor is CCCD - compare definition address to the generic definition address. Since all CCCD contexts are pointing to cccd_def this can be a reliable way to identify CCCD */
    if (desc_ctx->desc_def == &cccd_def)
    {
        ret = TRUE;
    }
    else
    {
        ret = FALSE;
    }

    return ret;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint16_t _ble_adapter_user_get_storage_kv_bond_pair_key(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint16_t slot_id)
{
    uint16_t kv_key_value = 0u;
    const uint16_t slot_id_mask = (((uint16_t)1u << STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_KEY_VIRT_DEV_ID_OFFSET) - (uint16_t)1u);

    kv_key_value = (uint16_t)(((uint16_t)virt_dev_id << STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_KEY_VIRT_DEV_ID_OFFSET) | (slot_id & slot_id_mask));

    return kv_key_value;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_search_bond_pair_kv_record(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t peer_identity_addr_type, const uint8_t peer_identity[SID_STM32_BLE_ADDRESS_LENGTH], uint16_t * const out_slot_id)
{
    sid_error_t err = SID_ERROR_NOT_FOUND;
    sid_error_t kv_err = SID_ERROR_NONE;

    for (uint32_t i = 0u; i < SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES; i++)
    {
        sid_pal_ble_ext_peer_identity_addr_t kv_bond_pair;
        const uint16_t bond_pair_kv_key = _ble_adapter_user_get_storage_kv_bond_pair_key(virt_dev_id, (uint16_t)i);

        kv_err = sid_pal_storage_kv_record_get(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP, bond_pair_kv_key, &kv_bond_pair, sizeof(kv_bond_pair));
        if (SID_ERROR_NONE == kv_err)
        {
            /* Found a valid record - check if it describes the current bond pair */
            if ((kv_bond_pair.identity_address_type == peer_identity_addr_type)
                      && (SID_STM32_UTIL_fast_memcmp(peer_identity, kv_bond_pair.identity_address, sizeof(kv_bond_pair.identity_address)) == 0u))
            {
                /* Found the matching identity record - connection is allowed */
                err = SID_ERROR_NONE;
                if (out_slot_id != NULL)
                {
                    *out_slot_id = (uint16_t)i;
                }
                break;
            }
            else
            {
                /* Non-matching record - proceed to the next one */
                continue;
            }
        }
        else if (SID_ERROR_NOT_FOUND == kv_err)
        {
            /* Record does not exists, proceed to the next slot */
            continue;
        }
        else
        {
            /* Generic KV storage failure - terminate */
            err = kv_err;
            break;
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _ble_adapter_user_are_uuids_equal(const sid_ble_cfg_uuid_info_t * const uuid_a, const sid_ble_cfg_uuid_info_t * const uuid_b)
{
    uint32_t ret;

    do
    {
        uint32_t compare_len;

        if ((NULL == uuid_a) || (NULL == uuid_b))
        {
            /* Can't compare */
            ret = FALSE;
            break;
        }

        if (uuid_a->type != uuid_b->type)
        {
            /* UUIDs are not equal because they have different length */
            ret = FALSE;
            break;
        }

        switch (uuid_a->type)
        {
            case UUID_TYPE_16:
                compare_len = 2u;
                break;

            case UUID_TYPE_32:
                compare_len = 4u;
                break;

            case UUID_TYPE_128:
            default:
                compare_len = 16u;
                break;
        }

        ret = (SID_STM32_UTIL_fast_memcmp(uuid_a->uu, uuid_b->uu, compare_len) == 0u) ? TRUE : FALSE;
    } while (0);

    return ret;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline const sid_ble_ext_virtual_device_t * _ble_adapter_user_search_device_definition(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    const sid_ble_ext_virtual_device_t * dev_definition = NULL;

    if (NULL == sid_ble_drv_ctx.cfg)
    {
        return NULL;
    }

    for (uint32_t i = 0u; i < sid_ble_drv_ctx.cfg->custom_profiles.num_virtual_devices; i++)
    {
        const sid_ble_ext_virtual_device_t * const dev = &sid_ble_drv_ctx.cfg->custom_profiles.virtual_devices[i];
        if (virt_dev_id == dev->device_id)
        {
            dev_definition = dev;
            break;
        }
    }

    return dev_definition;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_ble_ext_virtual_device_node_t * _ble_adapter_user_search_device_node(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_ble_ext_virtual_device_node_t * dev_node = NULL;

    sid_pal_enter_critical_region();

    sid_ble_ext_virtual_device_node_t * current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);

    while (current_node != &active_virt_devs_list)
    {
        if (virt_dev_id == current_node->ctx->device_cfg->device_id)
        {
            /* Found existing device node */
            dev_node = current_node;
            break;
        }

        /* Advance to the next node */
        LST_get_next_node((tListNode *)current_node, (tListNode **)&current_node);
    }

    sid_pal_exit_critical_region();

    return dev_node;
}

/*----------------------------------------------------------------------------*/

#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0u)
SID_STM32_SPEED_OPTIMIZED static inline sid_ble_ext_virtual_device_node_t * _ble_adapter_user_search_first_node_by_type(const sid_ble_ext_virtual_device_role_t device_type)
{
    sid_ble_ext_virtual_device_node_t * dev_node = NULL;

    sid_pal_enter_critical_region();

    sid_ble_ext_virtual_device_node_t * current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);

    while (current_node != &active_virt_devs_list)
    {
        if ((current_node->ctx->device_cfg->device_type & device_type) != 0u)
        {
            /* Found existing device node */
            dev_node = current_node;
            break;
        }

        /* Advance to the next node */
        LST_get_next_node((tListNode *)current_node, (tListNode **)&current_node);
    }

    sid_pal_exit_critical_region();

