stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return dev_node;
}
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_ble_ext_virtual_device_node_t * _ble_adapter_user_search_device_node_by_conn_handle(const uint16_t conn_handle)
{
    sid_ble_ext_virtual_device_node_t * dev_node = NULL;

    sid_pal_enter_critical_region();

    sid_ble_ext_virtual_device_node_t * current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);

    /* Iterate over all virtual device node */
    while (current_node != &active_virt_devs_list)
    {
        /* This search is valid for connectable devices only */
        if ((SBEVDR_BLE_PERIPHERAL == current_node->ctx->device_cfg->device_type) || (SBEVDR_BLE_CENTRAL == current_node->ctx->device_cfg->device_type))
        {
            sid_ble_ext_conn_list_node_t * current_conn_node = (sid_ble_ext_conn_list_node_t *)(((tListNode *)&current_node->ctx->conn_list)->next);

            /* For each device node iterate over the list of connections */
            while (current_conn_node != &current_node->ctx->conn_list)
            {
                if (conn_handle == current_conn_node->ctx->conn_id)
                {
                    /* Found the associated device node for this connection */
                    dev_node = current_node;
                    break;
                }

                /* Advance to the next connection node */
                LST_get_next_node((tListNode *)current_conn_node, (tListNode **)&current_conn_node);
            }

            /* Jump out of main loop if the device node was found */
            if (dev_node != NULL)
            {
                break;
            }
        }

        /* Advance to the next node */
        LST_get_next_node((tListNode *)current_node, (tListNode **)&current_node);
    }

    sid_pal_exit_critical_region();

    return dev_node;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_ble_ext_conn_list_node_t * _ble_adapter_user_search_connection_node_by_conn_handle(const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const uint16_t conn_handle)
{
    sid_ble_ext_conn_list_node_t * conn_node = NULL;

    sid_pal_enter_critical_region();

    sid_ble_ext_conn_list_node_t * current_conn_node = (sid_ble_ext_conn_list_node_t *)(((tListNode *)&virt_dev_ctx->conn_list)->next);
    while (current_conn_node != &virt_dev_ctx->conn_list)
    {
        if (conn_handle == current_conn_node->ctx->conn_id)
        {
            /* Found the associated connection node */
            conn_node = current_conn_node;
            break;
        }

        /* Advance to the next node */
        LST_get_next_node((tListNode *)current_conn_node, (tListNode **)&current_conn_node);
    }

    sid_pal_exit_critical_region();

    return conn_node;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Search for the attribute-related contexts by attribute handle
 *
 * @note This method is valid only for BLE peripheral devices. Search is performed in the context of the virtual peripheral node
 *
 * @param [out] out_svc_ctx  Context of the GATT service that is associated with the attribute. This pointer is populated whenever the attribute in question turns to belong to one of the characteristics or characteristic descriptors of the service
 * @param [out] out_char_ctx Context of the GATT characteristic that is associated with the attribute. This pointer is set whenever the attribute is the value of this characteristic or belongs to the one of the characteristic descriptors within this characteristic
 * @param [out] out_dec_ctx  Context of the GATT characteristic descriptor that is associated with the attribute. Can be NULL if the attribute corresponds to the value of characteristic itself
 */
SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_user_search_att_ctx_by_handle(sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** out_char_ctx, sid_ble_ext_gatt_server_char_desc_ctx_t ** const out_desc_ctx,
                                                                                        const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const uint16_t att_handle)
{
    *out_svc_ctx = NULL;
    *out_char_ctx = NULL;
    *out_desc_ctx = NULL;

    sid_pal_enter_critical_region();
    do
    {
        /* This method is valid for BLE peripherals only */
        if (virt_dev_ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            break;
        }

        /* Go through the list of services */
        for (uint32_t i = 0u; ((i < virt_dev_ctx->periph.svc_ctxs_count) && (NULL == *out_svc_ctx)); i++)
        {
            sid_ble_ext_gatt_server_svc_ctx_t * const current_svc_ctx = &virt_dev_ctx->periph.svc_ctxs[i];

            /* Move to the next service if this one has no characteristics */
            if ((NULL == current_svc_ctx->char_ctxs) || (0u == current_svc_ctx->char_ctxs_count))
            {
                continue;
            }

            /* Iterate over the list of characteristics */
            for (uint32_t j = 0u; ((j < current_svc_ctx->char_ctxs_count) && (NULL == *out_char_ctx)); j++)
            {
                sid_ble_ext_gatt_server_char_ctx_t * const current_char_ctx = &current_svc_ctx->char_ctxs[j];
                if (att_handle == (current_char_ctx->handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET))
                {
                    /* The attribute in question corresponds to the value attribute of the current characteristic. Search is finished */
                    *out_svc_ctx  = current_svc_ctx;
                    *out_char_ctx = current_char_ctx;
                    break;
                }

                /* Move to the next characteristic if this one has no descriptors */
                if ((NULL == current_char_ctx->desc_ctxs) || (0u == current_char_ctx->desc_ctxs_count))
                {
                    continue;
                }

