stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                /* Iterate over the list of characteristic descriptors */
                for (uint32_t k = 0u; k < current_char_ctx->desc_ctxs_count; k++)
                {
                    sid_ble_ext_gatt_server_char_desc_ctx_t * const current_desc_ctx = &current_char_ctx->desc_ctxs[k];
                    if (att_handle == current_desc_ctx->handle)
                    {
                        /* The attribute in question corresponds to one of the characteristic descriptors of the current characteristic. Search is finished */
                        *out_svc_ctx  = current_svc_ctx;
                        *out_char_ctx = current_char_ctx;
                        *out_desc_ctx  = current_desc_ctx;
                        break;
                    }
                }
            }
        }
    } while (0);
    sid_pal_exit_critical_region();
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Search for the service and characteristic contexts by characteristic UUID
 *
 * @note This method is valid only for BLE peripheral devices. Search is performed in the context of the virtual peripheral node
 *
 * @param [in] virt_dev_ctx Context of the virtual BLE device for which the search is performed
 * @param [in] char_uuid Characteristic UUID to look for
 * @param [out] out_svc_ctx  Context of the GATT service that is associated with the characteristic
 * @param [out] out_char_ctx Context of the GATT characteristic (if found)
 */
SID_STM32_SPEED_OPTIMIZED static inline void _ble_adapter_user_search_char_ctx_by_uuid(const sid_ble_ext_virtual_device_ctx_t * const virt_dev_ctx, const sid_ble_cfg_uuid_info_t * const char_uuid, sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** out_char_ctx)
{
    *out_svc_ctx = NULL;
    *out_char_ctx = NULL;

    sid_pal_enter_critical_region();
    do
    {
        /* This method is valid for BLE peripherals only */
        if (virt_dev_ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            break;
        }

        /* Go through the list of services */
        for (uint32_t i = 0u; ((i < virt_dev_ctx->periph.svc_ctxs_count) && (NULL == *out_svc_ctx)); i++)
        {
            sid_ble_ext_gatt_server_svc_ctx_t * const current_svc_ctx = &virt_dev_ctx->periph.svc_ctxs[i];

            /* Move to the next service if this one has no characteristics */
            if ((NULL == current_svc_ctx->char_ctxs) || (0u == current_svc_ctx->char_ctxs_count))
            {
                continue;
            }

            /* Iterate over the list of characteristics */
            for (uint32_t j = 0u; ((j < current_svc_ctx->char_ctxs_count) && (NULL == *out_char_ctx)); j++)
            {
                sid_ble_ext_gatt_server_char_ctx_t * const current_char_ctx = &current_svc_ctx->char_ctxs[j];

                if (_ble_adapter_user_are_uuids_equal(&current_char_ctx->char_def->uuid, char_uuid) != FALSE)
                {
                    /* Found the characteristic */
                    *out_svc_ctx = current_svc_ctx;
                    *out_char_ctx = current_char_ctx;
                    break;
                }
            }
        }
    } while (0);
    sid_pal_exit_critical_region();
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static uint32_t _ble_adapter_user_check_device_requires_pairing(const sid_ble_ext_virtual_device_t * const device_cfg)
{
    uint32_t needs_pairing = FALSE;

    do
    {
        /* Non-connectable devices do not need pairing by definition */
        if ((SBEVDR_BLE_BROADCASTER == device_cfg->device_type) || (SBEVDR_BLE_OBSERVER == device_cfg->device_type))
        {
            needs_pairing = FALSE;
            break;
        }

        if (SBEVDR_BLE_PERIPHERAL == device_cfg->device_type)
        {
            /* Iterate over the GATT profile and check if there's any characteristic that requires pairing for access */
            const sid_ble_ext_gatt_profile_def_t * const gatt_profile = &device_cfg->peripheral_cfg.gatt_profile;
            needs_pairing = FALSE;

            for (uint32_t svc_idx = 0u; ((svc_idx < gatt_profile->svc_count) && (FALSE == needs_pairing)); svc_idx++)
            {
                const sid_ble_ext_gatt_svc_def_t * const svc_def = &gatt_profile->services[svc_idx];

                /* Check characteristics within the service */
                for (uint32_t char_idx = 0u; ((char_idx < svc_def->char_count) && (FALSE == needs_pairing)); char_idx++)
                {
                    const sid_ble_ext_char_def_t * const char_def = &svc_def->characteristics[char_idx];

                    if ((char_def->permissions.authen_read != FALSE)
                      || (char_def->permissions.encry_read != FALSE)
                      || (char_def->permissions.authen_write != FALSE)
                      || (char_def->permissions.encry_write != FALSE))
                    {
                        /* Characteristic itself needs pairing */
                        needs_pairing = TRUE;
                        break;
                    }

                    /* Check characteristic descriptors within characteristic */
                    for (uint32_t desc_idx = 0u; desc_idx < char_def->desc_count; desc_idx++)
                    {
                        const sid_ble_ext_char_desc_t * const desc_def = &char_def->descriptors[desc_idx];

                        if ((desc_def->security.authen_read != FALSE)
                          || (desc_def->security.encry_read != FALSE)
                          || (desc_def->security.authen_write != FALSE)
                          || (desc_def->security.encry_write != FALSE))
                        {
                            /* Characteristic itself needs pairing */
                            needs_pairing = TRUE;
                            break;
                        }
                    }
                }
            }
        }

        if (SBEVDR_BLE_CENTRAL == device_cfg->device_type)
        {
            //TODO: implement support for Central role
            needs_pairing = FALSE;
            break;
        }
    } while (0);

    return needs_pairing;
}

