stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline sid_error_t _ble_adapter_user_set_adv_params(const sid_ble_ext_virtual_device_ctx_t * const device_ctx, const uint32_t adv_interval_min, const uint32_t adv_interval_max)
{
    sid_error_t       err;
    tBleStatus        ble_status;

    SID_PAL_ASSERT(adv_interval_min <= adv_interval_max);
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
    SID_PAL_ASSERT(adv_interval_min >= SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval_max <= SID_BLE_HCI_EXTENDED_ADV_INTERVAL_MAX);
#else
    SID_PAL_ASSERT(adv_interval_min >= SID_BLE_HCI_ADV_INTERVAL_MIN);
    SID_PAL_ASSERT(adv_interval_max <= SID_BLE_HCI_ADV_INTERVAL_MAX);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */
    SID_PAL_ASSERT(device_ctx != NULL);
    SID_PAL_ASSERT(device_ctx->device_cfg != NULL);

    do
    {
        uint8_t own_addr_type = sid_stm32wba_ble_adapter_util_convert_sid_ble_addr_type_to_hci_own_adv_addr_type(device_ctx->device_cfg->mac_addr_type);
        uint8_t adv_type;
        int8_t  adv_tx_power;
        uint8_t scan_resp_en;

        /* Select advertisement type based on the device role */
        switch (device_ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                SID_PAL_ASSERT(device_ctx->device_cfg->peripheral_cfg.adv_param != NULL);
                adv_tx_power = device_ctx->device_cfg->peripheral_cfg.adv_param->adv_tx_power;
                scan_resp_en = device_ctx->device_cfg->peripheral_cfg.adv_param->scan_resp_en != FALSE ? 0x01u : 0x00u;
                adv_type     = HCI_ADV_TYPE_ADV_IND;
                err          = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                SID_PAL_ASSERT(device_ctx->device_cfg->broadcaster_cfg.adv_param != NULL);
                adv_tx_power = device_ctx->device_cfg->broadcaster_cfg.adv_param->adv_tx_power;
                scan_resp_en = device_ctx->device_cfg->broadcaster_cfg.adv_param->scan_resp_en != FALSE ? 0x01u : 0x00u;
                adv_type     = scan_resp_en ? HCI_ADV_TYPE_ADV_SCAN_IND : HCI_ADV_TYPE_ADV_NONCONN_IND;
                err          = SID_ERROR_NONE;
                break;

            default:
                /* Other roles can't advertise */
                err = SID_ERROR_INVALID_ARGS;
                break;
        }

        /* Check if device role is ok */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Configure Identity Address for RPA */
        uint8_t                          ia_addr_type;
        sid_pal_ble_prv_bt_addr_buffer_t ia_addr;

#if SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS
        ia_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM;
        err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&ia_addr);
#else
        ia_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC;
        err = sid_stm32wba_ble_adapter_util_get_host_public_addr(&ia_addr);
#endif /* SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        int8_t selected_adv_tx_pwr;
        if ((adv_tx_power > SID_BLE_HCI_ADV_TX_POWER_MAX) && (adv_tx_power != SID_BLE_HCI_ADV_TX_POWER_NO_PREFERENCE))
        {
            adv_tx_power = SID_BLE_HCI_ADV_TX_POWER_MAX;
        }

        /* Configure extended advertisement set for current virtual device */
        ble_status = hci_le_set_extended_advertising_parameters(
                        device_ctx->device_cfg->device_id,
                        SID_STM32_BLE_LEGACY_ADV_TYPE_TO_EXT_ADV_EVT_PROPS(adv_type), /* Use legacy advertisement PDU */
                        (uint8_t *)(void *)&adv_interval_min,
                        (uint8_t *)(void *)&adv_interval_max,
                        (ADV_CH_37 | ADV_CH_38 | ADV_CH_39),                          /* Use all channels for advertisement */
                        own_addr_type,
                        ia_addr_type,                                                 /* Point to local host peer address for RPA, unused for other host address types */
                        (uint8_t *)ia_addr.bytes,                                     /* Point to local host peer address for RPA, unused for other host address types */
                        HCI_ADV_FILTER_NO,                                            /* Don't use any filters */
                        (uint8_t)adv_tx_power,                                        /* Tx power preference - no guarantees here */
                        HCI_PRIMARY_ADV_PHY_LE_1M,
                        0x00u,                                                        /* Secondary_Advertising_Max_Skip - irrelevant for legacy Adv PDU */
                        HCI_TX_PHY_LE_2M,                                             /* Secondary advertisement PHY - irrelevant for legacy Adv PDU */
                        0x00u,                                                        /* Advertising_SID - irrelevant for legacy Adv PDU */
                        scan_resp_en,                                                 /* Scan request notifications enabled */
                        (uint8_t *)&selected_adv_tx_pwr);                             /* Advertisement Tx power selected by the Host Controller */
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_extended_advertising_parameters - fail, result: 0x%02X, set: 0x%02X", ble_status, device_ctx->device_cfg->device_id);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        SID_BLE_USER_LOG_DEBUG("==>> hci_le_set_extended_advertising_parameters - Success, set: 0x%02X, Tx power: %s%ddBm", device_ctx->device_cfg->device_id, selected_adv_tx_pwr > 0 ? "+" : "", selected_adv_tx_pwr);
#else
        (void)adv_tx_power;
        (void)scan_resp_en;

        ble_status = hci_le_set_advertising_parameters(
                        (uint16_t)adv_interval_min,
                        (uint16_t)adv_interval_max,
                        adv_type,
                        own_addr_type,
                        ia_addr_type,                                           /* Point to local host peer address for RPA, unused for other host address types */
                        (uint8_t *)ia_addr.bytes,                               /* Point to local host peer address for RPA, unused for other host address types */
                        (ADV_CH_37 | ADV_CH_38 | ADV_CH_39),                    /* Use all channels for advertisement */
                        HCI_ADV_FILTER_NO);                                     /* Don't use any filters */
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_advertising_parameters - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }

        SID_BLE_USER_LOG_DEBUG("==>> hci_le_set_advertising_parameters - Success");
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

