stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_advertising_settings(sid_ble_ext_virtual_device_ctx_t * const node_ctx, const sid_ble_ext_adv_param_t * const adv_param)
{
    sid_error_t err;

    do
    {
        uint32_t adv_interval_min;
        uint32_t adv_interval_max;

        if (adv_param->fast_enabled != FALSE)
        {
            adv_interval_min = adv_param->fast_interval_min;
            adv_interval_max = adv_param->fast_interval_max;
        }
        else if (adv_param->slow_enabled != FALSE)
        {
            adv_interval_min = adv_param->slow_interval_min;
            adv_interval_max = adv_param->slow_interval_max;
        }
        else
        {
            SID_PAL_LOG_ERROR("Cannot initialize virtual BLE device \"%s\" (0x%02X). Both fast and slow advertising modes are disabled in config", node_ctx->device_cfg->device_name != NULL ? node_ctx->device_cfg->device_name : "<unnamed>", node_ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        err = _ble_adapter_user_set_adv_params(node_ctx, adv_interval_min, adv_interval_max);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to apply advertising params for virtual BLE device \"%s\" (0x%02X). Error %d", node_ctx->device_cfg->device_name != NULL ? node_ctx->device_cfg->device_name : "<unnamed>", node_ctx->device_cfg->device_id, (int32_t)err);
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_peripheral_gatt_char_descriptor(sid_ble_ext_gatt_server_char_desc_ctx_t * const out_desc_ctx, const uint16_t service_handle, const uint16_t char_handle,
                                                                                                    const sid_ble_ext_char_desc_t * const desc_def, const uint16_t max_att_mtu)
{
    sid_error_t err;

    do
    {
    	Char_Desc_Uuid_t stm_uuid;
        uint8_t stm_uuid_type;
        tBleStatus ble_status;

        /* Check if characteristic descriptor length and MTU size for the virtual device are aligned */
        if (desc_def->max_length > SID_STM32_BLE_ATT_LEN_LIMIT(max_att_mtu))
        {
            char uuid_text[40];
            const char * desc_display_name;

            if (desc_def->desc_name != NULL)
            {
                desc_display_name = desc_def->desc_name;
            }
            else
            {
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &desc_def->uuid);
                desc_display_name = uuid_text;
            }
            SID_PAL_LOG_ERROR("GATT characteristic descriptor \"%s\" length (%u) exceeds limit (%u) for selected max ATT MTU (%U). HCI error 0x%02X", desc_display_name, desc_def->max_length, SID_STM32_BLE_ATT_LEN_LIMIT(max_att_mtu), max_att_mtu);

            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Store the pointer to char definition for quick access */
        out_desc_ctx->desc_def = desc_def;

        /* Convert UUID to STM BLE stack format */
        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_desc_uuid(&stm_uuid_type, &stm_uuid, &desc_def->uuid);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid command, error code: %d", err);
            break;
        }

        /* Compute descriptor access permissions */
        uint8_t desc_access = ATTR_NO_ACCESS;
        uint8_t event_mask = GATT_DONT_NOTIFY_EVENTS;
        if (desc_def->access.read != FALSE)
        {
            desc_access |= ATTR_ACCESS_READ_ONLY;
            event_mask |= GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP;
        }
        if (desc_def->access.write != FALSE)
        {
            desc_access |= ATTR_ACCESS_WRITE_REQ_ONLY;
            event_mask |= (GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP | GATT_NOTIFY_ATTRIBUTE_WRITE);
        }
        if (desc_def->access.write_wo_resp != FALSE)
        {
            desc_access |= ATTR_ACCESS_WRITE_WITHOUT_RESPONSE;
            event_mask |= GATT_NOTIFY_ATTRIBUTE_WRITE;
        }

        /* Compute characteristic descriptor security permissions */
        uint8_t desc_security = ATTR_PERMISSION_NONE;
        if (desc_def->security.authen_read != FALSE)
        {
            desc_security |= ATTR_PERMISSION_AUTHEN_READ;
        }
        if (desc_def->security.author_read != FALSE)
        {
            desc_security |= ATTR_PERMISSION_AUTHOR_READ;
        }
        if (desc_def->security.encry_read != FALSE)
        {
            desc_security |= ATTR_PERMISSION_ENCRY_READ;
        }
        if (desc_def->security.authen_write != FALSE)
        {
            desc_security |= ATTR_PERMISSION_AUTHEN_WRITE;
        }
        if (desc_def->security.author_write != FALSE)
        {
            desc_security |= ATTR_PERMISSION_AUTHOR_WRITE;
        }
        if (desc_def->security.encry_write != FALSE)
        {
            desc_security |= ATTR_PERMISSION_ENCRY_WRITE;
        }

        /* Add characteristic to GATT database */
        ble_status = aci_gatt_add_char_desc(service_handle,
                                            char_handle,
                                            stm_uuid_type,
                                            &stm_uuid,
                                            desc_def->max_length,
                                            0u,
                                            NULL,
                                            desc_security,
                                            desc_access,
                                            event_mask,
                                            SID_STM32_BLE_CHAR_ENC_KEY_MINIMUM_LENGTH,
                                            CHAR_VALUE_LEN_VARIABLE,
                                            &out_desc_ctx->handle);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            char uuid_text[40];
            const char * desc_display_name;

            if (desc_def->desc_name != NULL)
            {
                desc_display_name = desc_def->desc_name;
            }
            else
            {
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &desc_def->uuid);
                desc_display_name = uuid_text;
            }
            SID_PAL_LOG_ERROR("Failed to add GATT characteristic descriptor \"%s\". HCI error 0x%02X", desc_display_name, ble_status);

            err = SID_ERROR_IO_ERROR;
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

