stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_peripheral_gatt_characteristic(sid_ble_ext_gatt_server_char_ctx_t * const out_char_ctx, const uint16_t service_handle, const sid_ble_ext_char_def_t * const char_def, const uint16_t max_att_mtu)
{
    sid_error_t err;

    do
    {
        Char_UUID_t stm_uuid;
        uint8_t stm_uuid_type;
        tBleStatus ble_status;

        /* Check if characteristic length and MTU size for the virtual device are aligned */
        if (char_def->max_length > SID_STM32_BLE_ATT_LEN_LIMIT(max_att_mtu))
        {
            char uuid_text[40];
            const char * char_display_name;

            if (char_def->char_name != NULL)
            {
                char_display_name = char_def->char_name;
            }
            else
            {
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &char_def->uuid);
                char_display_name = uuid_text;
            }
            SID_PAL_LOG_ERROR("GATT characteristic \"%s\" length (%u) exceeds limit (%u) for selected max ATT MTU (%U). HCI error 0x%02X", char_display_name, char_def->max_length, SID_STM32_BLE_ATT_LEN_LIMIT(max_att_mtu), max_att_mtu);

            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Store the pointer to char definition for quick access */
        out_char_ctx->char_def = char_def;

        /* Convert UUID to STM BLE stack format */
        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid(&stm_uuid_type, &stm_uuid, &char_def->uuid);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_char_uuid command, error code: %d", err);
            break;
        }

        /* Compute characteristic settings */
        uint8_t char_props = CHAR_PROP_NONE;
        uint8_t event_mask = GATT_DONT_NOTIFY_EVENTS;
        if (char_def->properties.read != FALSE)
        {
            char_props |= CHAR_PROP_READ;
            event_mask |= GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP;
        }
        if (char_def->properties.write != FALSE)
        {
            char_props |= CHAR_PROP_WRITE;
            event_mask |= (GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP | GATT_NOTIFY_ATTRIBUTE_WRITE);
        }
        if (char_def->properties.write_wo_resp != FALSE)
        {
            char_props |= CHAR_PROP_WRITE_WITHOUT_RESP;
            event_mask |= GATT_NOTIFY_ATTRIBUTE_WRITE;
        }
        if (char_def->properties.notify != FALSE)
        {
            char_props |= CHAR_PROP_NOTIFY;
            event_mask |= GATT_NOTIFY_NOTIFICATION_COMPLETION;
        }

        /* Compute characteristic security permissions */
        uint8_t char_perms = ATTR_PERMISSION_NONE;
        if (char_def->permissions.authen_read != FALSE)
        {
            char_perms |= ATTR_PERMISSION_AUTHEN_READ;
        }
        if (char_def->permissions.author_read != FALSE)
        {
            char_perms |= ATTR_PERMISSION_AUTHOR_READ;
        }
        if (char_def->permissions.encry_read != FALSE)
        {
            char_perms |= ATTR_PERMISSION_ENCRY_READ;
        }
        if (char_def->permissions.authen_write != FALSE)
        {
            char_perms |= ATTR_PERMISSION_AUTHEN_WRITE;
        }
        if (char_def->permissions.author_write != FALSE)
        {
            char_perms |= ATTR_PERMISSION_AUTHOR_WRITE;
        }
        if (char_def->permissions.encry_write != FALSE)
        {
            char_perms |= ATTR_PERMISSION_ENCRY_WRITE;
        }

        /* Add characteristic to GATT database */
        ble_status = aci_gatt_add_char(service_handle,
                                       stm_uuid_type,
                                       &stm_uuid,
                                       char_def->max_length,
                                       char_props,
                                       char_perms,
                                       event_mask,
                                       SID_STM32_BLE_CHAR_ENC_KEY_MINIMUM_LENGTH,
                                       CHAR_VALUE_LEN_VARIABLE,
                                       &out_char_ctx->handle);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            char uuid_text[40];
            const char * char_display_name;

            if (char_def->char_name != NULL)
            {
                char_display_name = char_def->char_name;
            }
            else
            {
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &char_def->uuid);
                char_display_name = uuid_text;
            }
            SID_PAL_LOG_ERROR("Failed to add GATT characteristic \"%s\". HCI error 0x%02X", char_display_name, ble_status);

            err = SID_ERROR_IO_ERROR;
            break;
        }

        /* Clear characteristic value */
        (void)aci_gatt_update_char_value(service_handle, out_char_ctx->handle, 0u, 0u, NULL);

        /* Add characteristics descriptors to controller -------------------------*/

        /* Check if this characteristic contains any special descriptors (e.g. SCCD, CCCD, etc.) */
        uint32_t special_desc_cnt = char_def->desc_count;
        uint32_t add_cccd = FALSE;
        if (char_def->properties.notify != FALSE)
        {
            special_desc_cnt++;
            add_cccd = TRUE;
        }

        /* Process special descriptors */
        uint32_t desc_idx_offset = 0u;
        if (add_cccd != FALSE)
        {
            sid_ble_ext_gatt_server_char_desc_ctx_t * const cccd_ctx = &out_char_ctx->desc_ctxs[desc_idx_offset];

            /* Update CCCD handle in the context */
            cccd_ctx->handle = out_char_ctx->handle + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET;

            desc_idx_offset++;
        }

        for (uint32_t i = 0u; i < char_def->desc_count; i++)
        {
            err = _ble_adapter_user_init_peripheral_gatt_char_descriptor(&out_char_ctx->desc_ctxs[i + desc_idx_offset], service_handle, out_char_ctx->handle, &char_def->descriptors[i], max_att_mtu);
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }

