stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Jump out if characteristic creation failed */
        if (err != SID_ERROR_NONE)
        {
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_peripheral_gatt_service(sid_ble_ext_gatt_server_svc_ctx_t * const out_svc_ctx, const sid_ble_ext_gatt_svc_def_t * const svc_definition, const uint16_t max_att_mtu)
{
    sid_error_t err;
    tBleStatus  ble_status;

    do
    {
        /* Allocate memory for characteristic contexts */
        out_svc_ctx->char_ctxs = calloc(svc_definition->char_count, sizeof(*out_svc_ctx->char_ctxs));
        if (NULL == out_svc_ctx->char_ctxs)
        {
            err = SID_ERROR_OOM;
            break;
        }

        /* Store the total number of service contexts in use */
        out_svc_ctx->char_ctxs_count = svc_definition->char_count;

        /* Set invalid handles before any further actions */
        for (uint32_t i = 0u; i < svc_definition->char_count; i++)
        {
            out_svc_ctx->char_ctxs[i].handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;
        }

        /* Allocate memory for all characteristic descriptors */
        uint32_t total_descriptors = 0u;
        err = SID_ERROR_NONE;
        for (uint32_t i = 0u; i < svc_definition->char_count; i++)
        {
            const sid_ble_ext_char_def_t * const char_def = &svc_definition->characteristics[i];
            sid_ble_ext_gatt_server_char_ctx_t * const char_ctx = &out_svc_ctx->char_ctxs[i];

            /* Allocate characteristic value buffer */
            char_ctx->data = malloc(char_def->max_length);
            if (NULL == char_ctx->data)
            {
                err = SID_ERROR_OOM;
                break;
            }

            /* Check if this characteristic contains any special descriptors (e.g. SCCD, CCCD, etc.) */
            uint32_t special_desc_cnt = char_def->desc_count;
            uint32_t add_cccd = FALSE;
            if (char_def->properties.notify != FALSE)
            {
                special_desc_cnt++;
                add_cccd = TRUE;
            }

            /* If this characteristic has any descriptors at all */
            if ((char_def->desc_count + special_desc_cnt) > 0u)
            {
                /* Allocate memory for descriptor contexts */
                char_ctx->desc_ctxs = calloc((char_def->desc_count + special_desc_cnt), sizeof(*char_ctx->desc_ctxs));
                if (NULL == char_ctx->desc_ctxs)
                {
                    err = SID_ERROR_OOM;
                    break;
                }

                /* Store the total number of descriptor contexts in use */
                char_ctx->desc_ctxs_count = (char_def->desc_count + special_desc_cnt);
                total_descriptors += char_def->desc_count; /* special_desc_cnt is out of scope for this counter as special descriptors are managed by ACI */

                /* Process special descriptors */
                uint32_t desc_idx_offset = 0u;
                if (add_cccd != FALSE)
                {
                    sid_ble_ext_gatt_server_char_desc_ctx_t * const cccd_ctx = &char_ctx->desc_ctxs[desc_idx_offset];

                    /* Set invalid handle value for the characteristic descriptor */
                    cccd_ctx->handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;

                    cccd_ctx->desc_def = &cccd_def;

                    /* Allocate characteristic value buffer */
                    cccd_ctx->data = malloc(cccd_ctx->desc_def->max_length);
                    if (NULL == cccd_ctx->data)
                    {
                        err = SID_ERROR_OOM;
                        break;
                    }

                    desc_idx_offset++;
                }

                /* Set invalid handles before any further actions */
                for (uint32_t j = 0u; j < char_def->desc_count; j++)
                {
                    const sid_ble_ext_char_desc_t * const desc_def = &char_def->descriptors[j];
                    sid_ble_ext_gatt_server_char_desc_ctx_t * const desc_ctx = &char_ctx->desc_ctxs[j + desc_idx_offset];

                    /* Set invalid handle value for the characteristic descriptor */
                    desc_ctx->handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;

                    desc_ctx->desc_def = desc_def;

                    /* Allocate characteristic value buffer */
                    desc_ctx->data = malloc(desc_def->max_length);
                    if (NULL == desc_ctx->data)
                    {
                        err = SID_ERROR_OOM;
                        break;
                    }
                }

                /* Jump out if memory allocation failed */
                if (err != SID_ERROR_NONE)
                {
                    break;
                }
            }
        }

        /* Jump out if memory allocation failed */
        if (err != SID_ERROR_NONE)
        {
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Add service to the controller ---------------------------------------------*/
        uint8_t        stm_uuid_type;
        Service_UUID_t stm_uuid;

        /* Convert UUID to the controller byte order */
        err = sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid(&stm_uuid_type, &stm_uuid, &svc_definition->uuid);
        if (err != SID_ERROR_NONE)
        {
            SID_BLE_USER_LOG_ERROR("  Fail   : sid_stm32wba_ble_adapter_util_convert_sid_uuid_to_stm32_svc_uuid command, error code: %d", err);
            break;
        }

        /* Add service to GATT database and retrieve its handle */
        ble_status = aci_gatt_add_service(stm_uuid_type,
                                          &stm_uuid,
                                          PRIMARY_SERVICE,
                                          (2u * (svc_definition->char_count + total_descriptors)) + 2u, /* Max_Attribute_Records = 2*no_of_char + 2*num_of_desc + 2 for svc */
                                          &out_svc_ctx->handle);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            char uuid_text[40];
            const char * svc_display_name;

