stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
            if (svc_definition->service_name != NULL)
            {
                svc_display_name = svc_definition->service_name;
            }
            else
            {
                (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &svc_definition->uuid);
                svc_display_name = uuid_text;
            }
            SID_PAL_LOG_ERROR("Failed to create GATT service \"%s\". HCI error 0x%02X", svc_display_name, ble_status);

            err = SID_ERROR_IO_ERROR;
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Add characteristics and descriptors to controller -------------------------*/
        for (uint32_t i = 0u; i < svc_definition->char_count; i++)
        {
            err = _ble_adapter_user_init_peripheral_gatt_characteristic(&out_svc_ctx->char_ctxs[i], out_svc_ctx->handle, &svc_definition->characteristics[i], max_att_mtu);
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }

        /* Jump out if characteristic creation failed */
        if (err != SID_ERROR_NONE)
        {
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_peripheral_gatt_services(sid_ble_ext_virtual_device_ctx_t * const node_ctx, const sid_ble_ext_gatt_profile_def_t * const gatt_profile)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Allocate memory for service contexts */
        node_ctx->periph.svc_ctxs = calloc(gatt_profile->svc_count, sizeof(*node_ctx->periph.svc_ctxs));
        if (NULL == node_ctx->periph.svc_ctxs)
        {
            err = SID_ERROR_OOM;
            break;
        }

        /* Store the total number of service contexts in use */
        node_ctx->periph.svc_ctxs_count = gatt_profile->svc_count;

        /* Set invalid handles before any further actions */
        for (uint32_t i = 0u; i < gatt_profile->svc_count; i++)
        {
            node_ctx->periph.svc_ctxs[i].handle = SID_STM32_BLE_HANDLE_INVALID_VALUE;
        }

        /* Instantiate each service */
        for (uint32_t i = 0u; i < gatt_profile->svc_count; i++)
        {
            err = _ble_adapter_user_init_peripheral_gatt_service(&node_ctx->periph.svc_ctxs[i], &gatt_profile->services[i], node_ctx->device_cfg->peripheral_cfg.max_att_mtu);
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }

        /* Jump out if service creation failed */
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to load GATT profile for virtual BLE device \"%s\" (0x%02X). Error %d", node_ctx->device_cfg->device_name != NULL ? node_ctx->device_cfg->device_name : "<unnamed>", node_ctx->device_cfg->device_id, err);
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_peripheral(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg->peripheral_cfg.adv_param != NULL);
    SID_PAL_ASSERT(SBEVDR_BLE_PERIPHERAL == node->ctx->device_cfg->device_type);

    do
    {
        const char * dev_name;
        uint32_t dev_name_len, dev_name_len_limit;
        uint8_t adv_name_type;
        uint8_t adv_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];
        const sid_ble_ext_adv_param_t * const adv_param = node->ctx->device_cfg->peripheral_cfg.adv_param;

        /* Validate inputs */
        if ((0u == node->ctx->device_cfg->peripheral_cfg.max_conn) || (node->ctx->device_cfg->peripheral_cfg.max_conn > CFG_BLE_NUM_LINK))
        {
            SID_PAL_LOG_ERROR("Invalid max connection number for virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }
        if ((node->ctx->device_cfg->peripheral_cfg.max_att_mtu < SID_BLE_HCI_DEFAULT_ATT_MTU) || (node->ctx->device_cfg->peripheral_cfg.max_att_mtu > CFG_BLE_ATT_MTU_MAX))
        {
            SID_PAL_LOG_ERROR("Invalid max MTU size for virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }
        if ((0u == node->ctx->device_cfg->peripheral_cfg.gatt_profile.svc_count) || (NULL == node->ctx->device_cfg->peripheral_cfg.gatt_profile.services))
        {
            SID_PAL_LOG_ERROR("Empty GATT profile for virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Instantiate GATT services */
        err = _ble_adapter_user_init_peripheral_gatt_services(node->ctx, &node->ctx->device_cfg->peripheral_cfg.gatt_profile);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_init_peripheral_gatt_services() */
            break;
        }

        /* Init advertising settings (e.g. create extended advertising set if supported) */
        err = _ble_adapter_user_init_advertising_settings(node->ctx, adv_param);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_init_advertising_settings() */
            break;
        }

        /* Build default advertising/scan response data */
        dev_name           = node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>";
        dev_name_len       = strlen(dev_name);
        dev_name_len_limit = sizeof(adv_bin_data) - (SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE + SID_BLE_HCI_ADV_TYPE_RECORD_SIZE); /* Space taken by device name header */

