stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Truncate device name if necessary */
        if (dev_name_len > dev_name_len_limit)
        {
            /* Determine the name type depending on if it fits or not */
            dev_name_len  = dev_name_len_limit;
            adv_name_type = AD_TYPE_SHORTENED_LOCAL_NAME;
        }
        else
        {
            adv_name_type = AD_TYPE_COMPLETE_LOCAL_NAME;
        }

        /* Copy as much as fits into the buffer */
        adv_bin_data[0] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + dev_name_len;
        adv_bin_data[1] = adv_name_type;
        SID_STM32_UTIL_fast_memcpy(&adv_bin_data[2], dev_name, dev_name_len);

        /* Set default scan response data if scan responses are enabled */
        if (adv_param->scan_resp_en != FALSE)
        {
            err = _ble_adapter_user_set_node_scan_resp_data(node, adv_bin_data, (adv_bin_data[0] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE));
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by _ble_adapter_user_set_node_scan_resp_data() */
                break;
            }
        }

        /* Prepare default advertisement data - it fits a bit less bytes */
        dev_name_len_limit -= (SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE + SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE); /* Space taken by mandatory advedrtising flags */
        
        /* Truncate device name even more if necessary */
        if (dev_name_len > dev_name_len_limit)
        {
            /* Determine the name type depending on if it fits or not */
            dev_name_len  = dev_name_len_limit;
            adv_name_type = AD_TYPE_SHORTENED_LOCAL_NAME;

            /* Update header */
            adv_bin_data[0] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + dev_name_len;
            adv_bin_data[1] = adv_name_type;
        }

        /* Set default advertising data */
        err = _ble_adapter_user_set_node_adv_data(node, adv_bin_data, (adv_bin_data[0] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE));
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_set_node_adv_data() */
            break;
        }

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING)
        tBleStatus ble_status;

        /* Update GAP device name */
        if (dev_name_len > SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN)
        {
            dev_name_len = SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN;
        }
        ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                sid_ble_drv_ctx.gap_dev_name_char_handle,
                                                0u,
                                                dev_name_len,
                                                (uint8_t *)dev_name);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X", ble_status);
            /* Do not fail the entire bootstrap process since this error is not a blocker */
        }
        else
        {
            SID_PAL_LOG_DEBUG("  Success: aci_gatt_update_char_value - Device Name");
        }

        /* Update preferred connection parameters */
        const sid_ble_cfg_conn_param_t * const conn_param = node->ctx->device_cfg->peripheral_cfg.conn_param;
        if (conn_param != NULL)
        {
            (void)sid_stm32wba_ble_adapter_util_set_gap_ppcp_char(conn_param);

            /* Do not fail the entire bootstrap process since PPCP error is not a blocker */
        }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init_broadcaster(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg->broadcaster_cfg.adv_param != NULL);
    SID_PAL_ASSERT(SBEVDR_BLE_BROADCASTER == node->ctx->device_cfg->device_type);

    do
    {
        const char * dev_name;
        uint32_t dev_name_len, dev_name_len_limit;
        uint8_t adv_name_type;
        uint8_t adv_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];
        const sid_ble_ext_adv_param_t * const adv_param = node->ctx->device_cfg->broadcaster_cfg.adv_param;

        err = _ble_adapter_user_init_advertising_settings(node->ctx, adv_param);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_init_advertising_settings() */
            break;
        }

        /* Build default advertising/scan response data */
        dev_name           = node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>";
        dev_name_len       = strlen(dev_name);
        dev_name_len_limit = sizeof(adv_bin_data) - (SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE + SID_BLE_HCI_ADV_TYPE_RECORD_SIZE); /* Space taken by device name header */

        /* Truncate device name if necessary */
        if (dev_name_len > dev_name_len_limit)
        {
            /* Determine the name type depending on if it fits or not */
            dev_name_len  = dev_name_len_limit;
            adv_name_type = AD_TYPE_SHORTENED_LOCAL_NAME;
        }
        else
        {
            adv_name_type = AD_TYPE_COMPLETE_LOCAL_NAME;
        }

        /* Copy as much as fits into the buffer */
        adv_bin_data[0] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + dev_name_len;
        adv_bin_data[1] = adv_name_type;
        SID_STM32_UTIL_fast_memcpy(&adv_bin_data[2], dev_name, dev_name_len);

        /* Set default scan response data if scan responses are enabled */
        if (adv_param->scan_resp_en != FALSE)
        {
            err = _ble_adapter_user_set_node_scan_resp_data(node, adv_bin_data, (adv_bin_data[0] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE));
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by _ble_adapter_user_set_node_scan_resp_data() */
                break;
            }
        }

