stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Prepare default advertisement data - it fits a bit less bytes */
        dev_name_len_limit -= (SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE + SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE); /* Space taken by mandatory advedrtising flags */
        
        /* Truncate device name even more if necessary */
        if (dev_name_len > dev_name_len_limit)
        {
            /* Determine the name type depending on if it fits or not */
            dev_name_len  = dev_name_len_limit;
            adv_name_type = AD_TYPE_SHORTENED_LOCAL_NAME;

            /* Update header */
            adv_bin_data[0] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + dev_name_len;
            adv_bin_data[1] = adv_name_type;
        }

        /* Set default advertising data */
        err = _ble_adapter_user_set_node_adv_data(node, adv_bin_data, (adv_bin_data[0] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE));
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_set_node_adv_data() */
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_init_central(sid_ble_ext_virtual_device_node_t * const node)
{
    (void)node;
    return SID_ERROR_NOSUPPORT;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_init_observer(sid_ble_ext_virtual_device_node_t * const node)
{
    (void)node;
    return SID_ERROR_NOSUPPORT;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_deinit_peripheral(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err;
    sid_error_t svc_del_err;
    tBleStatus  ble_status;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);

    do
    {
        /* Ensure advertising is stopped */
        (void)_ble_adapter_user_node_stop_advertisement(node);

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        /* Delete associated advertisement set */
        ble_status = hci_le_remove_advertising_set(node->ctx->device_cfg->device_id);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_WARNING("Failed to remove advertising set for virtual BLE device \"%s\" (0x%02X). Status 0x%02X", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id, ble_status);
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Terminate all the connections */
        while (LST_is_empty((tListNode *)&node->ctx->conn_list) == FALSE)
        {
            sid_ble_ext_conn_list_node_t * conn_node;

            LST_get_next_node((tListNode *)&node->ctx->conn_list, (tListNode **)&conn_node);
            err = _ble_adapter_user_node_disconnect(node, conn_node);
            if (err != SID_ERROR_NONE)
            {
                /* We can't disconnect - just skip this connection, remove it from list and deallocate memory */
                LST_remove_node((tListNode *)conn_node);
                free(conn_node);
            }
        }
        /*----------------------------------------------------------------------------*/

        /* Remove associated service(s) from GATT database ---------------------------*/
        /* Clear the root pointer to the contexts tree */
        sid_pal_enter_critical_region();
        sid_ble_ext_gatt_server_svc_ctx_t * const svc_ctxs       = node->ctx->periph.svc_ctxs;
        const uint32_t                            svc_ctxs_count = node->ctx->periph.svc_ctxs_count;
        node->ctx->periph.svc_ctxs_count = 0u;
        node->ctx->periph.svc_ctxs = NULL;
        sid_pal_exit_critical_region();

        /* Delete entire services from the controller */
        svc_del_err = SID_ERROR_NONE;
        for (uint32_t i = 0u; i < svc_ctxs_count; i++)
        {
            sid_ble_ext_gatt_server_svc_ctx_t * const svc_ctx = &svc_ctxs[i];

            ble_status = aci_gatt_del_service(svc_ctx->handle);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                char uuid_text[40];
                const char * svc_display_name;

                if (svc_ctx->svc_def->service_name != NULL)
                {
                    svc_display_name = svc_ctx->svc_def->service_name;
                }
                else
                {
                    (void)sid_stm32wba_ble_adapter_util_sprintf_uuid(uuid_text, &svc_ctx->svc_def->uuid);
                    svc_display_name = uuid_text;
                }
                SID_PAL_LOG_ERROR("Failed to delete GATT service \"%s\". HCI error 0x%02X", svc_display_name, ble_status);

                /* Set the error, but proceed with deleting the other services */
                svc_del_err = SID_ERROR_IO_ERROR;
            }

            if (NULL == svc_ctx->char_ctxs)
            {
                svc_ctx->char_ctxs_count = 0u;
                continue;
            }

            /* Iterate over the list of characteristics and deallocate memory */
            for (uint32_t j = 0u; j < svc_ctx->char_ctxs_count; j++)
            {
                sid_ble_ext_gatt_server_char_ctx_t * const char_ctx = &svc_ctx->char_ctxs[j];

                /* Deallocate characterstic value buffer */
                if (char_ctx->data != NULL)
                {
                    free(char_ctx->data);
                }
                char_ctx->data = NULL;
                char_ctx->data_length = 0u;

                /* Skip if there are no characteristic descriptors */
                if (NULL == char_ctx->desc_ctxs)
                {
                    svc_ctx->char_ctxs_count = 0u;
                    char_ctx->desc_ctxs_count = 0u;
                    continue;
                }

                /* Iterate over the list of characteristics and deallocate memory */
                for (uint32_t k = 0u; k < char_ctx->desc_ctxs_count; k++)
                {
                    sid_ble_ext_gatt_server_char_desc_ctx_t * const desc_ctx = &char_ctx->desc_ctxs[k];

                    if (desc_ctx->data != NULL)
                    {
                        free(desc_ctx->data);
                    }
                    desc_ctx->data = NULL;
                    desc_ctx->data_length = 0u;
                }

