stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                /* Deallocate char descriptor contexts */
                char_ctx->desc_ctxs_count = 0u;
                free(char_ctx->desc_ctxs);
                char_ctx->desc_ctxs = NULL;
            }

            /* Deallocate characteristic contexts for all chars in the service */
            svc_ctx->char_ctxs_count = 0u;
            free(svc_ctx->char_ctxs);
            svc_ctx->char_ctxs = NULL;
        }

        /* Deallocate contexts for all the services in the GATT profile */
        free(svc_ctxs);

        /* Done */
        err = svc_del_err;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_deinit_broadcaster(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);

    do
    {
        /* Ensure advertising is stopped */
        (void)_ble_adapter_user_node_stop_advertisement(node);

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        /* Delete associated advertisement set */
        tBleStatus ble_status = hci_le_remove_advertising_set(node->ctx->device_cfg->device_id);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_PAL_LOG_WARNING("Failed to remove advertising set for virtual BLE device \"%s\" (0x%02X). Status 0x%02X", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id, ble_status);
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_deinit_central(sid_ble_ext_virtual_device_node_t * const node)
{
    (void)node;
    return SID_ERROR_NOSUPPORT;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_deinit_observer(sid_ble_ext_virtual_device_node_t * const node)
{
    (void)node;
    return SID_ERROR_NOSUPPORT;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_terminate_device_node(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err;

    SID_PAL_ASSERT(node != NULL);

    do
    {
        /* Ensure the node is marked as terminating */
        sid_pal_enter_critical_region();
        /* Update device state */
        node->ctx->state = SBEVD_STATE_TERMINATING;
        __COMPILER_BARRIER();
        sid_pal_exit_critical_region();

        /* Perform role-specific tear down (e.g. remove adv set, terminate all connections, etc.) */
        switch (node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = _ble_adapter_user_deinit_peripheral(node);
                break;

            case SBEVDR_BLE_BROADCASTER:
                err = _ble_adapter_user_deinit_broadcaster(node);
                break;

            case SBEVDR_BLE_CENTRAL:
                err = _ble_adapter_user_deinit_central(node);
                break;

            case SBEVDR_BLE_OBSERVER:
                err = _ble_adapter_user_deinit_observer(node);
                break;

            default:
                err = SID_ERROR_INVALID_ARGS;
                break;
        }

        /* Exclude node from the list of active nodes */
        LST_remove_node((tListNode * )node);

        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to terminate virtual BLE device \"%s\" (0x%02X). Error %d", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id, (int32_t)err);
            /* Don't jump out of loop here as we still need to deallocate memory */
        }
        else
        {
            /* Print out status message now as we are about to destroy node context, it won't be possible to print device name & ID after th memory is deallocated */
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) terminated", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
        }

        /* Deallocate memory for the node */
        free(node->ctx);
        free(node);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_set_node_adv_data(sid_ble_ext_virtual_device_node_t * const node, const uint8_t * const raw_data, const uint32_t raw_data_length)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);

    do
    {
        uint8_t adv_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];

        /* Validate inputs */
        if ((NULL == raw_data) || (0u == raw_data_length))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if ((node->ctx->device_cfg->device_type != SBEVDR_BLE_BROADCASTER) && (node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL))
        {
            SID_PAL_LOG_ERROR("Advertising data can be set for Broadcaster and Peripheral roles only. Virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        /* Cleanup any previous data */
        SID_STM32_UTIL_fast_memset(adv_bin_data, 0u, sizeof(adv_bin_data));

        /* Build advertisement data */
        uint32_t adv_pos = 0u;

        /* Add advertisement flags */
        adv_bin_data[adv_pos] = SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE;
        adv_pos += SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE;
        adv_bin_data[adv_pos] = AD_TYPE_FLAGS;
        adv_pos += SID_BLE_HCI_ADV_TYPE_RECORD_SIZE;
        adv_bin_data[adv_pos] = (FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE | FLAG_BIT_BR_EDR_NOT_SUPPORTED);
        adv_pos += SID_BLE_HCI_ADV_FLAGS_RECORD_SIZE;

