stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Verify the supplied raw data fits into the buffer */
        if (raw_data_length > (sizeof(adv_bin_data) - adv_pos))
        {
            SID_PAL_LOG_ERROR("Supplied advertising data is too long. Virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Pre-validate raw data */
        uint32_t raw_data_pos = 0u;
        while (raw_data_pos < raw_data_length)
        {
            if (raw_data[raw_data_pos] < (SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_RECORD_SIZE_MIN))
            {
                /* That's invalid, this byte should keep the length of the advertising data record which is at least two bytes */
                raw_data_pos = UINT32_MAX;
                break;
            }

            /* Advance position by the length of the current advertising data record */
            raw_data_pos += (raw_data[raw_data_pos] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE);
        }

        if (raw_data_pos != raw_data_length)
        {
            /* Mismatch between the supplied adv data length and the actual computed length based on the adv data format */
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Copy user-supplied data into the buffer */
        SID_STM32_UTIL_fast_memcpy(&adv_bin_data[adv_pos], raw_data, raw_data_length);
        adv_pos += raw_data_length;

        SID_PAL_ASSERT(adv_pos <= MAX_ADV_DATA_LEN);

        /* Put advertisement data into the host controller */
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        ble_status = hci_le_set_extended_advertising_data(node->ctx->device_cfg->device_id,
                                                          HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                          SID_BLE_HCI_SET_ADV_DATA_FRAGMENT_PREF_NO_FRAGMENT,
                                                          sizeof(adv_bin_data), (uint8_t *)adv_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_extended_advertising_data - fail, result: 0x%02X, set: 0x%02X", ble_status, node->ctx->device_cfg->device_id);
            err = SID_BLE_HCI_STATUS_UNKNOWN_ADV_IDENTIFIER == ble_status ? SID_ERROR_UNINITIALIZED : SID_ERROR_IO_ERROR; /* Advertisement set shall be created first via calling hci_le_set_extended_advertising_parameters */
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> Success: hci_le_set_extended_advertising_data, set: 0x%02X", node->ctx->device_cfg->device_id);
#else
        /* Use legacy advertisement API */
        ble_status = hci_le_set_advertising_data(adv_pos, (uint8_t *)adv_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_advertising_data - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> Success: hci_le_set_advertising_data");
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_set_node_scan_resp_data(sid_ble_ext_virtual_device_node_t * const node, const uint8_t * const raw_data, const uint32_t raw_data_length)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus  ble_status;

    SID_PAL_ASSERT(node != NULL);
    SID_PAL_ASSERT(node->ctx != NULL);
    SID_PAL_ASSERT(node->ctx->device_cfg != NULL);

    do
    {
        uint8_t sr_bin_data[SID_STM32_BLE_MAX_ADVERTISING_BUFFER_SIZE];

        /* Validate inputs */
        if ((NULL == raw_data) || (0u == raw_data_length))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if ((node->ctx->device_cfg->device_type != SBEVDR_BLE_BROADCASTER) && (node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL))
        {
            SID_PAL_LOG_ERROR("Scan response data can be set for Broadcaster and Peripheral roles only. Virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        /* Build scan response data */
        uint32_t sr_pos = 0u;

        /* Verify the supplied raw data fits into the buffer */
        if (raw_data_length > (sizeof(sr_bin_data) - sr_pos))
        {
            SID_PAL_LOG_ERROR("Supplied scan response data is too long. Virtual BLE device \"%s\" (0x%02X)", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Pre-validate raw data */
        uint32_t raw_data_pos = 0u;
        while (raw_data_pos < raw_data_length)
        {
            if (raw_data[raw_data_pos] < (SID_BLE_HCI_ADV_TYPE_RECORD_SIZE + SID_BLE_HCI_ADV_RECORD_SIZE_MIN))
            {
                /* That's invalid, this byte should keep the length of the scan response data record which is at least two bytes */
                raw_data_pos = UINT32_MAX;
                break;
            }

            /* Advance position by the length of the current advertising data record */
            raw_data_pos += (raw_data[raw_data_pos] + SID_BLE_HCI_ADV_RECORD_LENGTH_SIZE);
        }

        if (raw_data_pos != raw_data_length)
        {
            /* Mismatch between the supplied scan response data length and the actual computed length based on the scan response data format */
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* Cleanup any previous data */
        SID_STM32_UTIL_fast_memset(sr_bin_data, 0u, sizeof(sr_bin_data));

        /* Copy user-supplied data into the buffer */
        SID_STM32_UTIL_fast_memcpy(&sr_bin_data[sr_pos], raw_data, raw_data_length);
        sr_pos += raw_data_length;

        SID_PAL_ASSERT(sr_pos <= MAX_ADV_DATA_LEN);

        /* Put scan response data into the host controller */
#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        ble_status = hci_le_set_extended_scan_response_data(node->ctx->device_cfg->device_id,
                                                            HCI_SET_ADV_DATA_OPERATION_COMPLETE,
                                                            SID_BLE_HCI_SET_ADV_DATA_FRAGMENT_PREF_NO_FRAGMENT,
                                                            sizeof(sr_bin_data), (uint8_t *)sr_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_extended_scan_response_data - fail, result: 0x%02X, set: 0x%02X", ble_status, node->ctx->device_cfg->device_id);
            err = SID_BLE_HCI_STATUS_UNKNOWN_ADV_IDENTIFIER == ble_status ? SID_ERROR_UNINITIALIZED : SID_ERROR_IO_ERROR; /* Advertisement set shall be created first via calling hci_le_set_extended_advertising_parameters */
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> Success: hci_le_set_extended_scan_response_data, set: 0x%02X", node->ctx->device_cfg->device_id);
#else
        /* Use legacy scan response API */
        ble_status = hci_le_set_scan_response_data(sr_pos, (uint8_t*)sr_bin_data);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> hci_le_set_scan_response_data - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> hci_le_set_scan_response_data - Success");
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

