stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_node_start_advertisement(sid_ble_ext_virtual_device_node_t * const node, const sid_ble_ext_adv_param_t * const adv_param)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        uint32_t                           adv_interval_min;
        uint32_t                           adv_interval_max;
        uint32_t                           adv_duration;
        sid_ble_ext_virtual_device_state_t targeted_state;
        sid_ble_ext_adv_state_change_t     adv_notify_event;

        /* Ensure the node is in the acceptable state for advertising */
        if ((node->ctx->state & (SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW)) != 0u)
        {
            /* Node is advertising already */
            SID_BLE_USER_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X) is advertising already", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id);
            err = SID_ERROR_INVALID_STATE;
            break;
        }
        else if (SBEVD_STATE_CONNECTED == node->ctx->state)
        {
            /* Node is connected, but if it allows multiple connection we can start advertising */
            if (SBEVDR_BLE_PERIPHERAL == node->ctx->device_cfg->device_type)
            {
                /* Check if the connection limit is reached */
                if (node->ctx->conn_cnt >= node->ctx->device_cfg->peripheral_cfg.max_conn)
                {
                    err = SID_ERROR_BUSY;
                    break;
                }
                else
                {
                    /* There are still free connection slots, we can proceed with advertising */
                }
            }
            else
            {
                /* Invalid node type */
                err = SID_ERROR_INVALID_STATE;
                break;
            }
        }
        else if (node->ctx->state != SBEVD_STATE_IDLE)
        {
            /* Node can be uninitialized, suspended, in error state, etc. Anyway, we can't proceed with advertising */
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        /* Select advertising parameters to use */
        if (adv_param->fast_enabled != FALSE)
        {
            adv_interval_min = adv_param->fast_interval_min;
            adv_interval_max = adv_param->fast_interval_max;
            adv_duration     = adv_param->fast_timeout;
            targeted_state   = SBEVD_STATE_ADV_FAST;
            adv_notify_event = SBEASC_ADV_STARTED_FAST;
        }
        else if (adv_param->slow_enabled != FALSE)
        {
            adv_interval_min = adv_param->slow_interval_min;
            adv_interval_max = adv_param->slow_interval_max;
            adv_duration     = adv_param->slow_timeout;
            targeted_state   = SBEVD_STATE_ADV_SLOW;
            adv_notify_event = SBEASC_ADV_STARTED_SLOW;
        }
        else
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        /* (Re)initialize advertising parameters */
        err = _ble_adapter_user_set_adv_params(node->ctx, adv_interval_min, adv_interval_max);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to apply advertising params for virtual BLE device \"%s\" (0x%02X). Error %d", node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>", node->ctx->device_cfg->device_id, (int32_t)err);
            break;
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED
        /* Update random address if required */
        if (SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC != node->ctx->device_cfg->mac_addr_type)
        {
            sid_pal_ble_prv_bt_addr_buffer_t adv_bd_addr;

            switch (node->ctx->device_cfg->mac_addr_type)
            {
                case SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM:
                    /* Load static random address for this device */
                    err = sid_stm32wba_ble_adapter_util_get_host_static_random_addr(&adv_bd_addr);
                    break;

                case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_RESOLVABLE:
                case SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
                default:
                    /* Generate a unique private random non-resolvable address for advertisement set. If RPA is used, this NRPA will be a back up address */
                    err = sid_stm32wba_ble_adapter_util_generate_private_nonresolvable_random_mac_address(&adv_bd_addr);
                    break;
            }

            if (err != SID_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("  Fail   : Unable to set random device address, error code: %d", (int32_t)err);
                break;
            }

            /* Set address to be used by advertisement set */
            tBleStatus ble_status = hci_le_set_advertising_set_random_address(node->ctx->device_cfg->device_id, (uint8_t *)adv_bd_addr.bytes);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_PAL_LOG_ERROR("==>> hci_le_set_advertising_set_random_address - fail, result: 0x%02X, set: 0x%02X", ble_status, node->ctx->device_cfg->device_id);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_BLE_USER_LOG_DEBUG("==>> hci_le_set_advertising_set_random_address - Success, set: 0x%02X", node->ctx->device_cfg->device_id);
            SID_BLE_USER_LOG_DEBUG("   Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x", adv_bd_addr.bytes[5],
                                                                                                 adv_bd_addr.bytes[4],
                                                                                                 adv_bd_addr.bytes[3],
                                                                                                 adv_bd_addr.bytes[2],
                                                                                                 adv_bd_addr.bytes[1],
                                                                                                 adv_bd_addr.bytes[0]);
        }
#else
        /* Update random address if required */
        if (SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC != node->ctx->device_cfg->mac_addr_type)
        {
            err = sid_stm32wba_ble_adapter_prv_rotate_random_mac_address(NULL, node->ctx->device_cfg->mac_addr_type);
            if (err != SID_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("  Fail   : unable to rotate BLE random address, error %d", (int32_t)err);
                break;
            }
            SID_PAL_LOG_DEBUG("  Success: rotate_random_mac_address");
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Build advertising set descriptor for HCI interface */
        Adv_Set_t hci_adv_set = {
            .Advertising_Handle              = node->ctx->device_cfg->device_id,
            .Duration                        = adv_duration,
            .Max_Extended_Advertising_Events = 0u,
        };

        /* Start advertising */
        err = sid_stm32wba_ble_adapter_prv_generic_start_advertisement(&hci_adv_set);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_start_advertisement */
            break;
        }

        /* Indicate that we are advertising */
        node->ctx->state = targeted_state;

        /* Notify user about the advertising start */
        sid_ble_ext_on_adv_state_changed_cb_t on_adv_state_changed;
        if (SBEVDR_BLE_PERIPHERAL == node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = node->ctx->device_cfg->peripheral_cfg.callbacks.on_adv_state_changed;
        }
        else if (SBEVDR_BLE_BROADCASTER == node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = node->ctx->device_cfg->broadcaster_cfg.callbacks.on_adv_state_changed;
        }
        else
        {
            on_adv_state_changed = NULL;
        }

        if (on_adv_state_changed != NULL)
        {
            on_adv_state_changed(node->ctx, adv_notify_event);
        }

        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) started advertising in %s mode",
                         node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>",
                         node->ctx->device_cfg->device_id,
                         SBEVD_STATE_ADV_FAST == targeted_state ? "fast" : "slow");
    } while (0);

