stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_node_stop_advertisement(sid_ble_ext_virtual_device_node_t * const node)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Ensure the node is in the acceptable state for advertising */
        if ((node->ctx->state < SBEVD_STATE_FATAL_ERROR) && (node->ctx->state >= SBEVD_STATE_IDLE) && ((node->ctx->state & (SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW)) == 0u))
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        /* Stop advertising */
        err = sid_stm32wba_ble_adapter_prv_generic_stop_advertisement(node->ctx->device_cfg->device_id);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Advertisement is stopped */
        if ((node->ctx->state < SBEVD_STATE_FATAL_ERROR) && (node->ctx->state >= SBEVD_STATE_IDLE))
        {
            /* Clear advertising status bits */
            node->ctx->state &= ~(SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW);

            if ((node->ctx->state & SBEVD_STATE_CONNECTED) == 0u)
            {
                node->ctx->state = SBEVD_STATE_IDLE;
            }
        }

        sid_ble_ext_on_adv_state_changed_cb_t on_adv_state_changed;
        if (SBEVDR_BLE_PERIPHERAL == node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = node->ctx->device_cfg->peripheral_cfg.callbacks.on_adv_state_changed;
        }
        else if (SBEVDR_BLE_BROADCASTER == node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = node->ctx->device_cfg->broadcaster_cfg.callbacks.on_adv_state_changed;
        }
        else
        {
            on_adv_state_changed = NULL;
        }

        if ((on_adv_state_changed != NULL) && (node->ctx->state < SBEVD_STATE_FATAL_ERROR) && (node->ctx->state >= SBEVD_STATE_IDLE))
        {
            on_adv_state_changed(node->ctx, SBEASC_ADV_SWITCHED_TERMINATED_ON_REQUEST);
        }

        if ((node->ctx->state < SBEVD_STATE_FATAL_ERROR) && (node->ctx->state >= SBEVD_STATE_IDLE))
        {
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) stopped advertising on request",
                             node->ctx->device_cfg->device_name != NULL ? node->ctx->device_cfg->device_name : "<unnamed>",
                             node->ctx->device_cfg->device_id);
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_node_disconnect(sid_ble_ext_virtual_device_node_t * const node, sid_ble_ext_conn_list_node_t * const conn_node)
{
    sid_error_t                        err = SID_ERROR_GENERIC;
    tBleStatus                         ble_status;
    uint32_t                           ll_lock_was_acquired;
    sid_pal_ble_prv_connection_ctx_t * prv_conn_ctx = NULL;

    /* Check if LL is locked by the current thread */
    if (osThreadGetId() == osMutexGetOwner(LinkLayerMutex))
    {
        /* Yes, we will have temporarily release the LL mutex */
        ll_lock_was_acquired = TRUE;
    }
    else
    {
        /* Nope, we don't have to deal with the LL mutex */
        ll_lock_was_acquired = FALSE;
    }

    do
    {
        /* Validate state */
        if ((NULL == node) || (NULL == conn_node))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        if (SID_STM32_BLE_HANDLE_INVALID_VALUE == conn_node->ctx->conn_id)
        {
            /* Already disconnected */
            err = SID_ERROR_PORT_NOT_OPEN;
            break;
        }

        /* Prepare to wait for disconnection completion */
        prv_conn_ctx = containerof(conn_node->ctx, sid_pal_ble_prv_connection_ctx_t, public_ctx);
        sid_stm32wba_ble_adapter_prv_gap_cmd_arm_resp_wait(prv_conn_ctx);

        if (ll_lock_was_acquired != FALSE)
        {
            /* Temporarily release mutex to allow BLE stack to process disconnect */
            (void)osMutexRelease(LinkLayerMutex);
        }
        __COMPILER_BARRIER();

        /* Initiate disconnect */
        ble_status = aci_gap_terminate(conn_node->ctx->conn_id, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("==>> aci_gap_terminate - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> aci_gap_terminate - Success");

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    if (SID_ERROR_NONE == err)
    {
        /* Wait for disconnect to complete */
        err = sid_stm32wba_ble_adapter_prv_gap_cmd_resp_wait(prv_conn_ctx);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to wait for BLE disconnect completion for connection 0x%04X. Error %d", conn_node->ctx->conn_id, (int32_t)err);
        }

        /* Re-acquire LL mutex if it was previously acquired by this thread */
        if (ll_lock_was_acquired != FALSE)
        {
            (void)osMutexAcquire(LinkLayerMutex, osWaitForever);
        }
    }

    /* For Sidewalk stack invoking this method if there's no active connection is not an error */
    if (SID_ERROR_PORT_NOT_OPEN == err)
    {
        err = SID_ERROR_NONE;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static SVCCTL_EvtAckStatus_t _ble_adapter_user_gatt_event_handler(void * p_Event)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    do
    {
        const hci_event_pckt * const p_event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)p_Event)->data);
        const evt_blecore_aci *      p_blecore_evt;
        tBleStatus                   ble_status;

        switch(p_event_pckt->evt)
        {
            case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
                p_blecore_evt = (evt_blecore_aci*)p_event_pckt->data;

                switch(p_blecore_evt->ecode)
                {
                    case ACI_GATT_PREPARE_WRITE_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_prepare_write_permit_req_event_rp0 * const p_prepare_write_permit_req = (aci_gatt_prepare_write_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code;
                            sid_ble_ext_virtual_device_node_t       * dev_node;
                            sid_ble_ext_conn_list_node_t            * conn_node;
                            sid_ble_ext_gatt_server_svc_ctx_t       * svc_ctx;
                            sid_ble_ext_gatt_server_char_ctx_t      * char_ctx;
                            sid_ble_ext_gatt_server_char_desc_ctx_t * desc_ctx;

