stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                            evt_ack_status = _ble_adapter_user_process_gatt_attr_rw_permit_req(p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle, &resp_error_code, SBEAAT_WRITE_ACCESS, (p_prepare_write_permit_req->Offset + p_prepare_write_permit_req->Data_Length),
                                                                                               &dev_node, &conn_node, &svc_ctx, &char_ctx, &desc_ctx);

                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_write_resp(p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle,
                                                                 0x00u /* value can be written */, SID_STM32_BLE_ATT_STATUS_SUCCESS,
                                                                 p_prepare_write_permit_req->Data_Length, p_prepare_write_permit_req->Data);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to set BLE write response for connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_prepare_write_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                    break;
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected write request for BLE connection 0x%04X, attribute 0x%04X. Reason code 0x%02X", p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle, resp_error_code);

                                ble_status = aci_gatt_write_resp(p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle,
                                                                 0x01u /* write req rejected */, resp_error_code,
                                                                 p_prepare_write_permit_req->Data_Length, p_prepare_write_permit_req->Data);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to set BLE write response for connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_prepare_write_permit_req->Connection_Handle, p_prepare_write_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_prepare_write_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;

                    case ACI_GATT_WRITE_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_write_permit_req_event_rp0 * const p_write_permit_req = (aci_gatt_write_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code;
                            sid_ble_ext_virtual_device_node_t       * dev_node;
                            sid_ble_ext_conn_list_node_t            * conn_node;
                            sid_ble_ext_gatt_server_svc_ctx_t       * svc_ctx;
                            sid_ble_ext_gatt_server_char_ctx_t      * char_ctx;
                            sid_ble_ext_gatt_server_char_desc_ctx_t * desc_ctx;

                            /* Do not process access to the General Attribute Service, this is handled by the generic part of the driver */
                            if (p_write_permit_req->Attribute_Handle == (SID_STM32_BLE_GATT_SVC_SERVICE_CHANGED_CHAR_HANDLE + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET))
                            {
                                break;
                            }

                            evt_ack_status = _ble_adapter_user_process_gatt_attr_rw_permit_req(p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle, &resp_error_code, SBEAAT_WRITE_ACCESS, p_write_permit_req->Data_Length,
                                                                                               &dev_node, &conn_node, &svc_ctx, &char_ctx, &desc_ctx);

                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_write_resp(p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle,
                                                                 0x00u /* value can be written */, SID_STM32_BLE_ATT_STATUS_SUCCESS,
                                                                 p_write_permit_req->Data_Length, p_write_permit_req->Data);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to set BLE write response for connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_write_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                    break;
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected write request for BLE connection 0x%04X, attribute 0x%04X. Reason code 0x%02X", p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle, resp_error_code);

