stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                                ble_status = aci_gatt_write_resp(p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle,
                                                                 0x01u /* write req rejected */, resp_error_code,
                                                                 p_write_permit_req->Data_Length, p_write_permit_req->Data);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to set BLE write response for connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_write_permit_req->Connection_Handle, p_write_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_write_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;

                    case ACI_GATT_READ_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_read_permit_req_event_rp0 * const p_read_permit_req = (aci_gatt_read_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code;
                            sid_ble_ext_virtual_device_node_t       * dev_node;
                            sid_ble_ext_conn_list_node_t            * conn_node;
                            sid_ble_ext_gatt_server_svc_ctx_t       * svc_ctx;
                            sid_ble_ext_gatt_server_char_ctx_t      * char_ctx;
                            sid_ble_ext_gatt_server_char_desc_ctx_t * desc_ctx;

                            evt_ack_status = _ble_adapter_user_process_gatt_attr_rw_permit_req(p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, &resp_error_code, SBEAAT_READ_ACCESS, (p_read_permit_req->Offset + 1u),
                                                                                               &dev_node, &conn_node, &svc_ctx, &char_ctx, &desc_ctx);

                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_allow_read(p_read_permit_req->Connection_Handle);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to allow read for BLE connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected read request for BLE connection 0x%04X, attribute 0x%04X. Reason code 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, resp_error_code);

                                ble_status = aci_gatt_deny_read(p_read_permit_req->Connection_Handle, resp_error_code);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to deny read for BLE connection 0x%04X, attribute 0x%04X. ACI error 0x%02X", p_read_permit_req->Connection_Handle, p_read_permit_req->Attribute_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;

                    case ACI_GATT_READ_MULTI_PERMIT_REQ_VSEVT_CODE:
                        {
                            const aci_gatt_read_multi_permit_req_event_rp0 * const p_read_multi_permit_req = (aci_gatt_read_multi_permit_req_event_rp0 *)p_blecore_evt->data;
                            uint8_t resp_error_code;

                            for (uint32_t i = 0u; i < p_read_multi_permit_req->Number_of_Handles; i++)
                            {
                                sid_ble_ext_virtual_device_node_t       * dev_node;
                                sid_ble_ext_conn_list_node_t            * conn_node;
                                sid_ble_ext_gatt_server_svc_ctx_t       * svc_ctx;
                                sid_ble_ext_gatt_server_char_ctx_t      * char_ctx;
                                sid_ble_ext_gatt_server_char_desc_ctx_t * desc_ctx;

                                evt_ack_status = _ble_adapter_user_process_gatt_attr_rw_permit_req(p_read_multi_permit_req->Connection_Handle, p_read_multi_permit_req->Handle_Item[i].Handle, &resp_error_code, SBEAAT_READ_ACCESS, 0u,
                                                                                                   &dev_node, &conn_node, &svc_ctx, &char_ctx, &desc_ctx);

                                /* Jump out if this connection handle is not related to the User BLE mode or if the access is explicitly prohibited */
                                if (evt_ack_status != SVCCTL_EvtAckFlowEnable)
                                {
                                    break;
                                }
                            }

                            /* Send the response */
                            if (SVCCTL_EvtAckFlowEnable == evt_ack_status)
                            {
                                ble_status = aci_gatt_allow_read(p_read_multi_permit_req->Connection_Handle);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to allow multiple attribute read for BLE connection 0x%04X. ACI error 0x%02X", p_read_multi_permit_req->Connection_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_multi_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }
                            }
                            else if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                SID_PAL_LOG_WARNING("Rejected read multiple request for BLE connection 0x%04X. Reason code 0x%02X", p_read_multi_permit_req->Connection_Handle, resp_error_code);

                                ble_status = aci_gatt_deny_read(p_read_multi_permit_req->Connection_Handle, resp_error_code);
                                if (ble_status != BLE_STATUS_SUCCESS)
                                {
                                    SID_PAL_LOG_ERROR("Failed to deny multiple attribute read for BLE connection 0x%04X. ACI error 0x%02X", p_read_multi_permit_req->Connection_Handle, ble_status);
                                    (void)aci_gap_terminate(p_read_multi_permit_req->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                                }

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                            else
                            {
                                /* Nothing to do here */
                            }
                        }
                        break;

