stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                    case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
                        {
                            const aci_gatt_attribute_modified_event_rp0 * const p_attribute_modified = (aci_gatt_attribute_modified_event_rp0 *)p_blecore_evt->data;

                            /* Do not process access to the General Attribute Service, this is handled by the generic part of the driver */
                            if (p_attribute_modified->Attr_Handle == (SID_STM32_BLE_GATT_SVC_SERVICE_CHANGED_CHAR_HANDLE + SID_STM32_BLE_CHARACTERISTIC_CCCD_ATTRIBUTE_OFFSET))
                            {
                                break;
                            }

                            evt_ack_status = _ble_adapter_user_process_gatt_attr_modified_evt(p_attribute_modified);

                            if (SVCCTL_EvtAckFlowDisable == evt_ack_status)
                            {
                                (void)aci_gap_terminate(p_attribute_modified->Connection_Handle, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);

                                /* Done with processing of this event */
                                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                            }
                        }
                        break;

                    default:
                        /* Allow other handlers to process this event */
                        break;
                }
                break;

#if SID_STM32_BLE_DLE_ENABLE
            case HCI_LE_META_EVT_CODE:
                evt_ack_status = _ble_adapter_user_process_hci_le_meta_evt((evt_le_meta_event *)p_event_pckt->data);
                break;
#endif /* SID_STM32_BLE_DLE_ENABLE */

            default:
                /* Allow other handlers to process this event */
                break;
        }
    } while (0);

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_user_process_gatt_attr_rw_permit_req(const uint16_t conn_handle, const uint16_t att_handle, uint8_t * const out_att_status_code, const sid_ble_ext_att_access_type_t access_mode, const uint32_t full_data_length,
                                                                                                                sid_ble_ext_virtual_device_node_t ** const out_dev_node ,sid_ble_ext_conn_list_node_t ** const out_conn_node,
                                                                                                                sid_ble_ext_gatt_server_svc_ctx_t ** const out_svc_ctx, sid_ble_ext_gatt_server_char_ctx_t ** const out_char_ctx, sid_ble_ext_gatt_server_char_desc_ctx_t ** const out_desc_ctx)
{
    SVCCTL_EvtAckStatus_t evt_ack_status;

    do
    {
        *out_dev_node  = NULL;
        *out_conn_node = NULL;
        *out_svc_ctx   = NULL;
        *out_char_ctx  = NULL;
        *out_desc_ctx  = NULL;

        /* Locate associated virtual device node */
        *out_dev_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_handle);
        if (NULL == *out_dev_node)
        {
            /* No associated virtual device found -> this connection does not belong to the user mode */
            evt_ack_status = SVCCTL_EvtNotAck;
            break;
        }

        if ((*out_dev_node)->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            /* Normally should not happen, this event is relevant for Peripherals only */
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_INVALID_STATE;
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Locate associated connection node */
        *out_conn_node = _ble_adapter_user_search_connection_node_by_conn_handle((*out_dev_node)->ctx, conn_handle);
        if (NULL == *out_conn_node)
        {
            /* Normally should not happen */
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_INVALID_STATE;
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Handle GAP Device Name characteristic access */
        if ((SBEAAT_READ_ACCESS == access_mode) && (att_handle == (sid_ble_drv_ctx.gap_dev_name_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET)))
        {
            tBleStatus ble_status;
            const char * const gap_device_name = (*out_dev_node)->ctx->device_cfg->device_name;
            uint16_t gap_device_name_len = (NULL == gap_device_name) ? 0u : strlen(gap_device_name);

            if (gap_device_name_len > SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN)
            {
                gap_device_name_len = SID_STM32_BLE_GAP_DEVICE_NAME_MAX_LEN;
            }

            /* Update GAP device name */
            ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                    sid_ble_drv_ctx.gap_dev_name_char_handle,
                                                    0u,
                                                    gap_device_name_len,
                                                    (uint8_t *)gap_device_name);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                /* Failed to update GAP Device Name - prohibit reading since the characterstic will have wrong value */
                SID_BLE_USER_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Device Name, result: 0x%02X", ble_status);
                *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_GENERIC;
                evt_ack_status = SVCCTL_EvtAckFlowDisable;
                break;
            }
            else
            {
                /* Successfully updated GAP Device Name characterstic with the name of the current Virtual BLE device */
                SID_BLE_USER_LOG_DEBUG("  Success: aci_gatt_update_char_value - Device Name");
                *out_att_status_code = SID_STM32_BLE_ATT_STATUS_SUCCESS;
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break; /* Exit from here since we don't need to invoke user callback for GAP characteristics */
            }
        }

        /* Handle GAP Appearance characteristic access */
        if ((SBEAAT_READ_ACCESS == access_mode) && (att_handle == (sid_ble_drv_ctx.gap_appearance_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET)))
        {
            tBleStatus ble_status;
            const uint16_t gap_appearance = (*out_dev_node)->ctx->device_cfg->peripheral_cfg.appearance;

            /* Update GAP appearance */
            ble_status = aci_gatt_update_char_value(sid_ble_drv_ctx.gap_service_handle,
                                                    sid_ble_drv_ctx.gap_appearance_char_handle,
                                                    0u,
                                                    sizeof(gap_appearance),
                                                    (uint8_t *)(void *)&gap_appearance);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_BLE_USER_LOG_ERROR("  Fail   : aci_gatt_update_char_value - Appearance, result: 0x%02X", ble_status);
                *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_GENERIC;
                evt_ack_status = SVCCTL_EvtAckFlowDisable;
                break;
            }
            else
            {
                SID_BLE_USER_LOG_DEBUG("  Success: aci_gatt_update_char_value - Appearance");
                *out_att_status_code = SID_STM32_BLE_ATT_STATUS_SUCCESS;
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
                break; /* Exit from here since we don't need to invoke user callback for GAP characteristics */
            }
        }

        /* Handle GAP Preferred Connection Parameters characteristic access */
        if ((SBEAAT_READ_ACCESS == access_mode) && (att_handle == (sid_ble_drv_ctx.gap_ppcp_char_handle + SID_STM32_BLE_CHARACTERISTIC_VALUE_ATTRIBUTE_OFFSET)))
        {
            const sid_ble_cfg_conn_param_t * const conn_param = (*out_dev_node)->ctx->device_cfg->peripheral_cfg.conn_param;

            if (conn_param != NULL)
            {
                (void)sid_stm32wba_ble_adapter_util_set_gap_ppcp_char(conn_param);
            }

