stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_SUCCESS;
            evt_ack_status = SVCCTL_EvtAckFlowEnable;
            break; /* Exit from here since we don't need to invoke user callback for GAP characteristics */
        }

        /* Locate associated attribute context */
        _ble_adapter_user_search_att_ctx_by_handle(out_svc_ctx, out_char_ctx, out_desc_ctx, (*out_dev_node)->ctx, att_handle);

        if ((NULL == *out_svc_ctx) || (NULL == *out_char_ctx))
        {
            /* Corresponding attribute was not found - reject the request. This can happen if the attribute belongs to the virtual device A and access is performed by the virtual device B */
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_WRONG_VIRT_DEV;
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Ensure the operation is not exceeding the limits */
        uint32_t data_len_limit;
        if (*out_desc_ctx != NULL)
        {
            /* This attribute is characteristic descriptor, select corresponding length limit */
            data_len_limit = (*out_desc_ctx)->desc_def->max_length;
        }
        else
        {
            /* This attribute is characteristic value, select corresponding length limit */
            data_len_limit = (*out_char_ctx)->char_def->max_length;
        }
        
        if (full_data_length > data_len_limit)
        {
            /* Too much data -> reject request to avoid buffer overflow */
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_EXCEEDS_LIMIT;
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Invoke user callback to decide if access permission should be granted */
        if ((*out_dev_node)->ctx->device_cfg->peripheral_cfg.callbacks.on_att_access_request != NULL)
        {
            *out_att_status_code = (*out_dev_node)->ctx->device_cfg->peripheral_cfg.callbacks.on_att_access_request((*out_dev_node)->ctx, (*out_conn_node)->ctx, *out_svc_ctx, *out_char_ctx, *out_desc_ctx, access_mode);
            if (SID_STM32_BLE_ATT_STATUS_SUCCESS == *out_att_status_code)
            {
                evt_ack_status = SVCCTL_EvtAckFlowEnable;
            }
            else
            {
                evt_ack_status = SVCCTL_EvtAckFlowDisable;

                /* Ensure the response code is within the valid range for the read request */
                if (SBEAAT_READ_ACCESS == access_mode)
                {
                    if ((*out_att_status_code != SID_STM32_BLE_ATT_STATUS_INSUFFICIENT_AUTHOR) && ((*out_att_status_code < SID_STM32_BLE_ATT_STATUS_APP_ERROR_MIN) || (*out_att_status_code > SID_STM32_BLE_ATT_STATUS_APP_ERROR_MAX)))
                    {
                        SID_PAL_LOG_WARNING("Invalid ATT read reply status code - 0x%02X. Connection 0x%04X, attribute 0x%04X", *out_att_status_code, conn_handle, att_handle);
                        *out_att_status_code = SID_STM32_BLE_ATT_STATUS_APP_ERROR_GENERIC;
                    }
                }
            }
        }
        else
        {
            /* Grant permission if no user callback is set */
            *out_att_status_code = SID_STM32_BLE_ATT_STATUS_SUCCESS;
            evt_ack_status = SVCCTL_EvtAckFlowEnable;
        }
    } while (0);

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_user_process_gatt_attr_modified_evt(const aci_gatt_attribute_modified_event_rp0 * const evt)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    do
    {
        sid_ble_ext_virtual_device_node_t       * dev_node;
        sid_ble_ext_conn_list_node_t            * conn_node;
        sid_ble_ext_gatt_server_svc_ctx_t       * svc_ctx;
        sid_ble_ext_gatt_server_char_ctx_t      * char_ctx;
        sid_ble_ext_gatt_server_char_desc_ctx_t * desc_ctx;

        /* Locate associated virtual device node */
        dev_node = _ble_adapter_user_search_device_node_by_conn_handle(evt->Connection_Handle);
        if (NULL == dev_node)
        {
            /* No associated virtual device found -> this connection does not belong to the user mode */
            evt_ack_status = SVCCTL_EvtNotAck;
            break;
        }

        if (dev_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            /* Normally should not happen, this event is relevant for Peripherals only */
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Locate associated connection node */
        conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(dev_node->ctx, evt->Connection_Handle);
        if (NULL == conn_node)
        {
            /* Normally should not happen */
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Locate associated attribute context */
        _ble_adapter_user_search_att_ctx_by_handle(&svc_ctx, &char_ctx, &desc_ctx, dev_node->ctx, evt->Attr_Handle);

        if ((NULL == svc_ctx) || (NULL == char_ctx))
        {
            /* Corresponding attribute was not found - reject the request. This can happen if the attribute belongs to the virtual device A and access is performed by the virtual device B */
            evt_ack_status = SVCCTL_EvtAckFlowDisable;
            break;
        }

        /* Ensure the operation is not exceeding the limits */
        uint8_t  * rx_buf_ptr;
        uint16_t * valid_len_ptr;
        uint16_t * accum_len_ptr;
        uint32_t   data_len_limit;
        if (desc_ctx != NULL)
        {
            /* This attribute is characteristic descriptor, select corresponding length limit */
            rx_buf_ptr     = desc_ctx->data;
            valid_len_ptr  = &desc_ctx->data_length;
            accum_len_ptr  = &desc_ctx->upd_accum_len;
            data_len_limit = desc_ctx->desc_def->max_length;
        }
        else
        {
            /* This attribute is characteristic value, select corresponding length limit */
            rx_buf_ptr     = char_ctx->data;
            valid_len_ptr  = &char_ctx->data_length;
            accum_len_ptr  = &char_ctx->upd_accum_len;
            data_len_limit = char_ctx->char_def->max_length;
        }

        /* Ensure there are no systematic SW failures */
        SID_PAL_ASSERT(rx_buf_ptr != NULL);

        /* Check the received data does not exceed the receiving buffer size */
        const uint32_t store_offset     = (evt->Offset & (~SID_STM32_BLE_ACI_GATT_ATTRIBUTE_MODIFIED_MORE_DATA_PENDING_FLAG));
        const uint32_t more_data_pending = (evt->Offset & SID_STM32_BLE_ACI_GATT_ATTRIBUTE_MODIFIED_MORE_DATA_PENDING_FLAG) != 0u;

        /* Check the received data does not exceed the receiving buffer size */
        if ((store_offset + evt->Attr_Data_Length) > data_len_limit)
        {
            if (FALSE == more_data_pending) /* Print out the warning only once */
            {
                SID_PAL_LOG_WARNING("Received GATT attribute data exceeds processing buffer size (%u vs %u bytes). Data discarded", (store_offset + evt->Attr_Data_Length), data_len_limit);
            }
            evt_ack_status = SVCCTL_EvtAckFlowEnable;
            break;
        }

        SID_BLE_USER_LOG_DEBUG("==>>ATT received %u bytes%s", evt->Attr_Data_Length, more_data_pending ? ". More data pending" : "");
        SID_STM32_UTIL_fast_memcpy(&rx_buf_ptr[store_offset], evt->Attr_Data, evt->Attr_Data_Length);
        *accum_len_ptr += evt->Attr_Data_Length;

