stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Invoke user callback if all the data read out from the BLE stack */
        if (more_data_pending == FALSE)
        {
            SID_BLE_USER_LOG_DEBUG("==>>ATT: RX finished, totally received %u bytes", *accum_len_ptr);

            /* Reset the data accumulator offset */
            *valid_len_ptr = *accum_len_ptr;
            *accum_len_ptr = 0u;

            /* Data received from the GATT client in full - call the user callback */
            if ((desc_ctx != NULL) && (_ble_adapter_user_is_desc_cccd(desc_ctx) != FALSE))
            {
                /* This attribute is CCCD of a characteristic - notify the user about CCCD change */
                if (dev_node->ctx->device_cfg->peripheral_cfg.callbacks.on_cccd_changed != NULL)
                {
                    const sid_ble_ext_cccd_val_t * const cccd_val_ptr = (sid_ble_ext_cccd_val_t *)rx_buf_ptr;
                    dev_node->ctx->device_cfg->peripheral_cfg.callbacks.on_cccd_changed(dev_node->ctx, conn_node->ctx, svc_ctx, char_ctx, *cccd_val_ptr);
                }
            }
            else if (dev_node->ctx->device_cfg->peripheral_cfg.callbacks.on_data_received != NULL)
            {
                /* This just an ordinary attribute modification - call Data Received callback */
                dev_node->ctx->device_cfg->peripheral_cfg.callbacks.on_data_received(dev_node->ctx, conn_node->ctx, svc_ctx, char_ctx, desc_ctx, rx_buf_ptr, *valid_len_ptr);
            }
            else
            {
                /* Nothing to do */
            }
        }
        else
        {
            /* Indicate there's no valid data till we receive full update */
            *valid_len_ptr = 0u;
        }

        /* This event is processed, no further actions are required */
        evt_ack_status = SVCCTL_EvtAckFlowEnable;
    } while (0);

    return evt_ack_status;
}

/*----------------------------------------------------------------------------*/

#if SID_STM32_BLE_DLE_ENABLE
SID_STM32_SPEED_OPTIMIZED static inline SVCCTL_EvtAckStatus_t _ble_adapter_user_process_hci_le_meta_evt(const evt_le_meta_event * const evt)
{
    SVCCTL_EvtAckStatus_t evt_ack_status = SVCCTL_EvtNotAck;

    do
    {
        switch (evt->subevent)
        {
            case HCI_LE_DATA_LENGTH_CHANGE_SUBEVT_CODE:
                {
                    const hci_le_data_length_change_event_rp0 * const p_le_data_length_change = (hci_le_data_length_change_event_rp0 *)evt->data;
                    sid_ble_ext_virtual_device_node_t * const dev_node = _ble_adapter_user_search_device_node_by_conn_handle(p_le_data_length_change->Connection_Handle);

                    if (dev_node != NULL)
                    {
                        const sid_ble_ext_virtual_device_t * const virt_dev_cfg = dev_node->ctx->device_cfg;
                        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) DLE: MaxTxOctets: %u, MaxTxTime: %uus, MaxRxOctets: %u, MaxRxTime: %uus",
                                         virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>",
                                         virt_dev_cfg->device_id,
                                         p_le_data_length_change->MaxTxOctets,
                                         p_le_data_length_change->MaxTxTime,
                                         p_le_data_length_change->MaxRxOctets,
                                         p_le_data_length_change->MaxRxTime);

                        /* Event processing is finished */
                        evt_ack_status = SVCCTL_EvtAckFlowEnable;
                    }
                }
                break;

            default:
                /* Do nothing, allow the event flow to continue */
                break;
        }
    } while (0);

    return evt_ack_status;
}
#endif /* SID_STM32_BLE_DLE_ENABLE */

/* Private shared function definitions ---------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_init(void)
{
    sid_error_t err = SID_ERROR_GENERIC;
    uint32_t    ll_lock_acquired;
    const sid_pal_ble_prv_operating_mode_t init_type =
#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY)
                                                  SPBP_OPERATING_MODE_CONCURRENT;
#else
                                                  SPBP_OPERATING_MODE_USER;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_CONCURRENCY */

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_init function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible during User BLE init");

    do
    {
        sid_pal_enter_critical_region();

#if (SID_STM32_BLE_COEXISTENCE_MODE == SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING)
        if (sid_ble_drv_ctx.operating_mode != SPBP_OPERATING_MODE_OFF)
        {
            SID_PAL_LOG_ERROR("User BLE mode cannot be initialized because BLE radio is busy with another mode (%u)", sid_ble_drv_ctx.operating_mode);
            err = SID_ERROR_BUSY;
            sid_pal_exit_critical_region();
            break;
        }
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_INTERLEAVING */

        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_UNINITIALIZED)
        {
            /* Either User mode is activated already or the driver is in a transitional state, the user must wait till it reaches a stable state */
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        sid_ble_user_mode_ctx.state = SPBUM_STATE_INITIALIZING;
        __COMPILER_BARRIER();

        sid_pal_exit_critical_region();

        /* Obtain Sidewalk BLE config - it is required to compute the common BLE stack settings properly */
        const sid_ble_link_config_t * const sid_cfg = app_get_sidewalk_ble_config();
        SID_PAL_ASSERT(sid_cfg != NULL);

        err = sid_stm32wba_ble_adapter_prv_generic_init(init_type, sid_cfg->config);
        if (err != SID_ERROR_NONE)
        {
            /* Logs are provided by sid_stm32wba_ble_adapter_prv_generic_init() */
            break;
        }

        /* Create list of active virtual device contexts */
        sid_pal_enter_critical_region();
        LST_init_head((tListNode *)&active_virt_devs_list);
        sid_pal_exit_critical_region();

        /* Register GATT event handler for user mode */
        err = sid_stm32wba_ble_adapter_prv_generic_register_svc_handler(_ble_adapter_user_gatt_event_handler);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to register GATT handler for user-mode BLE. Error %d", (int32_t)err);
            break;
        }

