stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        SID_PAL_LOG_INFO("User BLE init done");
        sid_ble_user_mode_ctx.state = SPBUM_STATE_INITIALIZED;
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_init function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_deinit(void)
{
    sid_error_t err;
    sid_error_t gatt_deinit_err;
    sid_error_t rtos_resource_deinit_err;
    sid_error_t generic_deinit_err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_deinit function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible during User BLE deinit");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        sid_ble_user_mode_ctx.state = SPBUM_STATE_DEINITIALIZING;
        __COMPILER_BARRIER();

        sid_pal_exit_critical_region();

        /*----------------------------------------------------------------------------*/

        /* Iterate over the list of active devices and terminate every of them */
        sid_ble_ext_virtual_device_node_t * current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);
        while (current_node != &active_virt_devs_list)
        {
            /* Kill the node */
            (void)_ble_adapter_user_terminate_device_node(current_node);

            /* Advance to the next node */
            current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);
        }

        /* De-register GATT event handler */
        gatt_deinit_err = sid_stm32wba_ble_adapter_prv_generic_deregister_svc_handler(_ble_adapter_user_gatt_event_handler);

        rtos_resource_deinit_err = SID_ERROR_NONE;

        /*----------------------------------------------------------------------------*/

        generic_deinit_err = sid_stm32wba_ble_adapter_prv_generic_deinit();
        /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_deinit */

        /**
         * Select error with following priorities (highest to lowest)
         * 1. Generic deinitialization errors
         * 2. BLE GATT deinit errors
         * 3. RTOS resource deallocation errors
         */
        err = generic_deinit_err != SID_ERROR_NONE ? generic_deinit_err : (gatt_deinit_err != SID_ERROR_NONE ? gatt_deinit_err : rtos_resource_deinit_err);
    } while (0);

    if (SID_ERROR_NONE == err)
    {
        sid_ble_user_mode_ctx.state = SPBUM_STATE_UNINITIALIZED;
    }

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_deinit function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_factory_reset(void)
{
    sid_error_t err;

    do
    {
        /* Ensure BLE is non-functional at the moment */
        if (sid_ble_drv_ctx.operating_mode != SPBP_OPERATING_MODE_OFF)
        {
            SID_PAL_LOG_ERROR("BLE Factory Reset cannot be performed because BLE driver is initialized. Oeprating mode %u", sid_ble_drv_ctx.operating_mode);
            err = SID_ERROR_INVALID_STATE;
            break;
        }

#if SID_STM32_BLE_CLEAR_CFG_ON_FACTORY_RESET
        /* Clear config data in the KV storage */
        err = sid_pal_storage_kv_group_delete(STORAGE_KV_SID_BLE_ADAPTER_CONFIG_GROUP);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : Unable to delete sid ble adapter config group from kv storage, error code: %d", err);
            break;
        }
#endif /* SID_STM32_BLE_CLEAR_CFG_ON_FACTORY_RESET */

        /* Clear non-volatile bonding contexts in the KV storage */
        err = sid_pal_storage_kv_group_delete(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP);
        if (err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("  Fail   : Unable to delete sid ble adapter non-volatile bonding contexts from kv storage, error code: %d", err);
            break;
        }

        /* Erase NVM flash area */
        err = SID_ERROR_NONE;
        if (osKernelGetState() == osKernelRunning)
        {
            FM_Cmd_Status_t fm_status;
            osStatus_t os_status;

            /* RTOS is running, we can use Flash Manager module for async operations and to avoid conflicts with 2.4GHz radio operations */
            do
            {
                fm_status = FM_Erase(CFG_SNVMA_START_SECTOR_ID, (CFG_SNVMA_END_SECTOR_ID - CFG_SNVMA_START_SECTOR_ID) + 1u, &ble_adapter_user_fm_callback_node);
                if (fm_status != FM_OK)
                {
                    SID_PAL_LOG_ERROR("BLE NVM erase failed - Flash Manager error");
                    err = SID_ERROR_STORAGE_ERASE_FAIL;
                    break;
                }

                os_status = osSemaphoreAcquire(ble_adapter_user_fm_semaphore, osWaitForever);
                if (os_status != osOK)
                {
                    SID_PAL_LOG_ERROR("Failed to wait for BLE NVM earse completion. Error %d", (int32_t)os_status);
                    err = SID_ERROR_STORAGE_ERASE_FAIL;
                    break;
                }
            } while (ble_adapter_user_last_fm_status != FM_OPERATION_COMPLETE);
        }
        else
        {
            /* RTOS not running, fall back to direct calls to Flash Driver */
            (void)HAL_FLASH_Unlock();

            /* Data writing loop */
            for (uint32_t sector_id = CFG_SNVMA_START_SECTOR_ID; sector_id <= CFG_SNVMA_END_SECTOR_ID; sector_id++)
            {
                FD_FlashOp_Status_t fd_status = FD_EraseSectors(sector_id);
                if (fd_status != FD_FLASHOP_SUCCESS)
                {
                    SID_PAL_LOG_ERROR("Failed to erase BLE NVM page %u", sector_id);
                    err = SID_ERROR_STORAGE_ERASE_FAIL;
                    break;
                }
            }

            (void)HAL_FLASH_Lock();
        }
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Done */
        SID_PAL_LOG_INFO("User mode BLE factory reset completed");
        err = SID_ERROR_NONE;
    } while (0);

