stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_activate(const sid_ble_ext_virtual_device_id_t virt_dev_id, sid_ble_ext_virtual_device_ctx_t * * const out_ctx)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_activate function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        /* Entering danger zone - we are about to access and potentially modify the list of active devices */
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_UNINITIALIZED;
            sid_pal_exit_critical_region();
            break;
        }

        /* Validate inputs */
        if ((virt_dev_id < SID_STM32_BLE_CUSTOM_VIRT_DEV_ID_MIN) || (virt_dev_id > SID_STM32_BLE_CUSTOM_VIRT_DEV_ID_MAX))
        {
            SID_PAL_LOG_ERROR("Virtual BLE device ID 0x%02X is out of valid range (0x%02X - 0x%02X)", virt_dev_id, SID_STM32_BLE_CUSTOM_VIRT_DEV_ID_MIN, SID_STM32_BLE_CUSTOM_VIRT_DEV_ID_MAX);
            err = SID_ERROR_INVALID_ARGS;
            sid_pal_exit_critical_region();
            break;
        }

        if (NULL == out_ctx)
        {
            SID_PAL_LOG_ERROR("No storage provided for virtual BLE device 0x%02X context", virt_dev_id);
            err = SID_ERROR_INVALID_ARGS;
            sid_pal_exit_critical_region();
            break;
        }

        /* Check the configuration for this device exists */
        const sid_ble_ext_virtual_device_t * virt_dev_cfg = _ble_adapter_user_search_device_definition(virt_dev_id);
        if (NULL == virt_dev_cfg)
        {
            SID_PAL_LOG_ERROR("No definition of the virtual BLE device 0x%02X found", virt_dev_id);
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }
        /*----------------------------------------------------------------------------*/

        /* Verify the device is not activated already */
        sid_ble_ext_virtual_device_node_t * dev_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (dev_node != NULL)
        {
            SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X) is activated already", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
            *out_ctx = dev_node->ctx;
            err = SID_ERROR_ALREADY_INITIALIZED;
            sid_pal_exit_critical_region();
            break;
        }

        if (_ble_adapter_user_check_device_requires_pairing(virt_dev_cfg) != FALSE)
        {
            /* This device requires pairing - ensure it has compatible BLE address setting */
#if SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS
            /* If Static Random address is used as Identity Address virtual devices can use only Static Random and RPA addresses for pairing */
            if (SID_BLE_CFG_MAC_ADDRESS_TYPE_PUBLIC == virt_dev_cfg->mac_addr_type)
            {
                SID_PAL_LOG_ERROR("BLE pairing requires either Static Random or RPA address, but virtual BLE device \"%s\" (0x%02X) uses Public address", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
                err = SID_ERROR_NOSUPPORT;
                break;
            }
#else
            /* If Public address is used as Identity Address virtual devices can use only Public and RPA addresses for pairing */
            if (SID_BLE_CFG_MAC_ADDRESS_TYPE_STATIC_RANDOM == virt_dev_cfg->mac_addr_type)
            {
                SID_PAL_LOG_ERROR("BLE pairing requires either Public or RPA address, but virtual BLE device \"%s\" (0x%02X) uses Static Random address", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
                err = SID_ERROR_NOSUPPORT;
                break;
            }
#endif /* SID_STM32_BLE_USE_RANDOM_IDENTITY_ADDRESS */

            if (SID_BLE_CFG_MAC_ADDRESS_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE == virt_dev_cfg->mac_addr_type)
            {
                SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X): BLE pairing is not supported for non-resolvable addresses", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
                err = SID_ERROR_NOSUPPORT;
                break;
            }
        }

#if SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0
        /* Check the device can be activated - with no support for extended advertising we can only run one advertiser at a time */
        if ((SBEVDR_BLE_PERIPHERAL == virt_dev_cfg->device_type) || (SBEVDR_BLE_BROADCASTER == virt_dev_cfg->device_type))
        {
            sid_ble_ext_virtual_device_node_t * current_node = (sid_ble_ext_virtual_device_node_t *)(((tListNode *)&active_virt_devs_list)->next);
            uint32_t active_advertisers_exist = FALSE;

            while (current_node != &active_virt_devs_list)
            {
                if ((SBEVDR_BLE_PERIPHERAL == current_node->ctx->device_cfg->device_type) || (SBEVDR_BLE_BROADCASTER == current_node->ctx->device_cfg->device_type))
                {
                    /* Found an existing advertiser node */
                    active_advertisers_exist = TRUE;
                    break;
                }

                /* Advance to the next node */
                LST_get_next_node((tListNode *)current_node, (tListNode **)&current_node);
            }

            if (active_advertisers_exist != FALSE)
            {
                SID_PAL_LOG_ERROR("Can't bootstrap virtual BLE device \"%s\" (0x%02X) - another advetiser is currently active", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
                err = SID_ERROR_OUT_OF_RESOURCES;
                sid_pal_exit_critical_region();
                break;
            }
        }
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        /* Create new device node */
        dev_node = malloc(sizeof(*dev_node));
        if (NULL == dev_node)
        {
            SID_PAL_LOG_ERROR("Can't bootstrap virtual BLE device \"%s\" (0x%02X) - out of RAM", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
            err = SID_ERROR_OOM;
            sid_pal_exit_critical_region();
            break;
        }

        /* Allocate memory for device context */
        dev_node->ctx = calloc(1u, sizeof(*dev_node->ctx));
        if (NULL == dev_node)
        {
            SID_PAL_LOG_ERROR("Can't bootstrap virtual BLE device \"%s\" (0x%02X) - out of RAM", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
            err = SID_ERROR_OOM;
            sid_pal_exit_critical_region();
            break;
        }

        /* Set initial virtual device state */
        dev_node->ctx->state = SBEVD_STATE_BOOTSTRAPPING;

        /* Initialize connection list in the context */
        LST_init_head((tListNode *)&dev_node->ctx->conn_list);
        *((sid_ble_ext_connection_ctx_t **)&dev_node->ctx->conn_list.ctx) = NULL;
        dev_node->ctx->conn_cnt = 0u;

