stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Store device config pointer for faster access */
        dev_node->ctx->device_cfg = virt_dev_cfg;

        /* Add device node to the to list */
        LST_insert_tail((tListNode *)&active_virt_devs_list, (tListNode *)dev_node);

        /* Done with the critical stuff */
        sid_pal_exit_critical_region();

        /* Proceed with the role-specific initialization */
        SID_PAL_LOG_DEBUG("Bootstrapping virtual BLE device \"%s\" (0x%02X)", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);

        switch (virt_dev_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = _ble_adapter_user_init_peripheral(dev_node);
                break;

            case SBEVDR_BLE_BROADCASTER:
                err = _ble_adapter_user_init_broadcaster(dev_node);
                break;

            case SBEVDR_BLE_CENTRAL:
                err = _ble_adapter_user_init_central(dev_node);
                break;

            case SBEVDR_BLE_OBSERVER:
                err = _ble_adapter_user_init_observer(dev_node);
                break;

            default:
                SID_PAL_LOG_ERROR("Failed to bootstrap virtual BLE device 0x%02X. %u is not a valid virtual BLE device type", virt_dev_cfg->device_id, (uint32_t)virt_dev_cfg->device_type);
                err = SID_ERROR_INVALID_ARGS;
                break;
        }

        /* Check if the BLE initialization was successful */
        if (err != SID_ERROR_NONE)
        {
            /* Something went wrong, deallocate resources and terminate */
            dev_node->ctx->state = SBEVD_STATE_FATAL_ERROR;
            (void)_ble_adapter_user_terminate_device_node(dev_node);
            break;
        }
        else
        {
            /* Device is ready now */
            dev_node->ctx->state = SBEVD_STATE_IDLE;
        }

        /* Done */
        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) is ready", virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>", virt_dev_id);
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_activate function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_terminate(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_terminate function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is in the acceptable state for termination */
        if ((associated_node->ctx->state < SBEVD_STATE_SUSPENDED) || (associated_node->ctx->state >= SBEVD_STATE_TERMINATING))
        {
            /* Either device is in the process of termination already or its initialization has not finished */
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Update device state */
        associated_node->ctx->state = SBEVD_STATE_TERMINATING;
        __COMPILER_BARRIER();

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Terminate the virtual device */
        err = _ble_adapter_user_terminate_device_node(associated_node);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_terminate_device_node() */
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_terminate function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_set_adv_data(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t * const adv_data, const uint32_t adv_data_length)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_set_adv_data function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

