stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Ensure the node is capable of advertising at all */
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of advertising */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Set advertising data */
        err = _ble_adapter_user_set_node_adv_data(associated_node, adv_data, adv_data_length);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_set_node_adv_data() */
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_set_adv_data function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_set_scan_resp_data(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint8_t * const scan_resp_data, const uint32_t scan_resp_data_length)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_set_scan_resp_data function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is capable of advertising at all */
        const sid_ble_ext_adv_param_t * adv_param;
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                adv_param = associated_node->ctx->device_cfg->peripheral_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                adv_param = associated_node->ctx->device_cfg->broadcaster_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            default:
                adv_param = NULL;
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of advertising */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        if ((NULL == adv_param) || (FALSE == adv_param->scan_resp_en))
        {
            /* Scan responses are not allowed in the configuration */
            sid_pal_exit_critical_region();
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        /* Set advertising data */
        err = _ble_adapter_user_set_node_scan_resp_data(associated_node, scan_resp_data, scan_resp_data_length);
        if (err != SID_ERROR_NONE)
        {
            /* Logs provided by _ble_adapter_user_set_node_adv_data() */
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_set_scan_resp_data function");

    return err;
}

/*----------------------------------------------------------------------------*/

static sid_error_t _ble_adapter_user_virt_dev_adv_start(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_adv_start function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is capable of advertising at all */
        const sid_ble_ext_adv_param_t * adv_param;
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                adv_param = associated_node->ctx->device_cfg->peripheral_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                adv_param = associated_node->ctx->device_cfg->broadcaster_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of advertising */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Initiate advertising */
        err = _ble_adapter_user_node_start_advertisement(associated_node, adv_param);
        if (err != SID_ERROR_NONE)
        {
            /* Logs supplied by _ble_adapter_user_node_start_advertisement() */
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_adv_start function");

