stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_adv_stop(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_adv_stop function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is capable of advertising at all */
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of advertising */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Initiate advertising */
        err = _ble_adapter_user_node_stop_advertisement(associated_node);
        if (err != SID_ERROR_NONE)
        {
            /* Logs supplied by _ble_adapter_user_node_start_advertisement() */
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_adv_stop function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_get_bonded_peers(const sid_ble_ext_virtual_device_id_t virt_dev_id, sid_pal_ble_ext_peer_identity_addr_t * const out_bonded_peers_list, uint32_t * const out_bonded_peers_count, const uint32_t bonded_peers_list_size_limit)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_get_bonded_peers function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        /* Validate inputs */
        if ((NULL == out_bonded_peers_list) || (NULL == out_bonded_peers_count) || (0u == bonded_peers_list_size_limit))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        *out_bonded_peers_count = 0u;

        /* Run in a critical section to avoid mid-flight alterations of the KV data */
        sid_pal_enter_critical_region();

        err = SID_ERROR_NONE;

        for (uint32_t i = 0u; i < SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES; i++)
        {
            sid_pal_ble_ext_peer_identity_addr_t kv_bond_pair;
            const uint16_t bond_pair_kv_key = _ble_adapter_user_get_storage_kv_bond_pair_key(virt_dev_id, (uint16_t)i);

            err = sid_pal_storage_kv_record_get(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP, bond_pair_kv_key, &kv_bond_pair, sizeof(kv_bond_pair));
            if (SID_ERROR_NONE == err)
            {
                /* Found a valid record */
                if (*out_bonded_peers_count < bonded_peers_list_size_limit)
                {
                    SID_STM32_UTIL_fast_memcpy(&out_bonded_peers_list[*out_bonded_peers_count], &kv_bond_pair, sizeof(kv_bond_pair));
                }

                (*out_bonded_peers_count)++;
            }
            else if (SID_ERROR_NOT_FOUND == err)
            {
                /* Record does not exists, proceed to the next slot */
                continue;
            }
            else
            {
                /* Generic KV storage failure - terminate */
                break;
            }
        }

        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_get_bonded_peers function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_remove_bond(const sid_ble_ext_virtual_device_id_t virt_dev_id, const sid_pal_ble_ext_peer_identity_addr_t * const peer_identity)
{
    sid_error_t err;
    tBleStatus ble_status;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_remove_bond function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        uint16_t storage_kv_slot_id;

        /* Validate inputs */
        if (NULL == peer_identity)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

