stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        const sid_ble_ext_virtual_device_t * const virt_dev_cfg = _ble_adapter_user_search_device_definition(virt_dev_id);

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Check if the virtual device is found */
        if (NULL == virt_dev_cfg)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Check the virtual device is of the acceptable type */
        if (virt_dev_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        /* Locate the non-volatile bonding context */
        err = _ble_adapter_user_search_bond_pair_kv_record(virt_dev_id, peer_identity->identity_address_type, peer_identity->identity_address, &storage_kv_slot_id);
        if (SID_ERROR_NOT_FOUND == err)
        {
            /* Failed to locate the non-volatile bonding context of the peer identity that is associated with the specified virtual device */
            SID_PAL_LOG_ERROR("Failed to remove bonding info for peer %02X:%02X:%02X:%02X:%02X:%02X: it's not associated with the Virtual BLE device \"%s\" (0x%02X)",
                              peer_identity->identity_address[5],
                              peer_identity->identity_address[4],
                              peer_identity->identity_address[3],
                              peer_identity->identity_address[2],
                              peer_identity->identity_address[1],
                              peer_identity->identity_address[0],
                              virt_dev_cfg->device_name != NULL ? virt_dev_cfg->device_name : "<unnamed>",
                              virt_dev_id);
            break;
        }
        if (err != SID_ERROR_NONE)
        {
            /* Some other error */
            break;
        }

        /* Remove bonding from the controller */ 
        ble_status = aci_gap_remove_bonded_device(peer_identity->identity_address_type, peer_identity->identity_address);
        if (SID_BLE_HCI_STATUS_CMD_DISALLOWED == ble_status)
        {
            err = SID_ERROR_BUSY;
            break;
        }
        else if (ble_status != BLE_STATUS_SUCCESS)
        {
            err = SID_ERROR_IO_ERROR;
            break;
        }
        else
        {
            /* Nothing to do, verything is ok */
        }

        /* Erase the non-volatile bonding context */
        const uint16_t bond_pair_kv_key = _ble_adapter_user_get_storage_kv_bond_pair_key(virt_dev_id, storage_kv_slot_id);
        err = sid_pal_storage_kv_record_delete(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP, bond_pair_kv_key);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_remove_bond function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_disconnect(const sid_ble_ext_virtual_device_id_t virt_dev_id, const uint16_t conn_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_disconnect function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is capable of advertising at all */
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_CENTRAL:
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of connections */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Try to locate the specified connection */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Terminate the connection */
        err = _ble_adapter_user_node_disconnect(associated_node, conn_node);
        if (err != SID_ERROR_NONE)
        {
            /* Logs supplied by _ble_adapter_user_node_disconnect() */
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_disconnect function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_disconnect_all(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

