stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_disconnect_all function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the node is capable of advertising at all */
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_CENTRAL:
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of connections */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        while (LST_is_empty((tListNode *)&associated_node->ctx->conn_list) == FALSE)
        {
            sid_ble_ext_conn_list_node_t * conn_node;

            LST_get_next_node((tListNode *)&associated_node->ctx->conn_list, (tListNode **)&conn_node);
            err = _ble_adapter_user_node_disconnect(associated_node, conn_node);
            if (err != SID_ERROR_NONE)
            {
                /* We can't disconnect - just skip this connection, remove it from list and deallocate memory */
                LST_remove_node((tListNode *)conn_node);
                free(conn_node);
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_disconnect_all function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_suspend(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_resume function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        if ((associated_node->ctx->state < SBEVD_STATE_IDLE) || (associated_node->ctx->state >= SBEVD_STATE_FATAL_ERROR))
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Update device state; */
        associated_node->ctx->state = SBEVD_STATE_SUSPENDED;

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Terminate all advertisements */
        if ((SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type) || (SBEVDR_BLE_BROADCASTER == associated_node->ctx->device_cfg->device_type))
        {
            (void)_ble_adapter_user_node_stop_advertisement(associated_node);
        }

        /* Terminate all connections */
        if ((SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type) || (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type))
        {
            while (LST_is_empty((tListNode *)&associated_node->ctx->conn_list) == FALSE)
            {
                sid_ble_ext_conn_list_node_t * conn_node;

                LST_get_next_node((tListNode *)&associated_node->ctx->conn_list, (tListNode **)&conn_node);
                err = _ble_adapter_user_node_disconnect(associated_node, conn_node);
                if (err != SID_ERROR_NONE)
                {
                    /* We can't disconnect - just skip this connection, remove it from list and deallocate memory */
                    LST_remove_node((tListNode *)conn_node);
                    free(conn_node);
                }
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_resume function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_resume(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_resume function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

