stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        if (SBEVD_STATE_SUSPENDED == associated_node->ctx->state)
        {
            associated_node->ctx->state = SBEVD_STATE_IDLE;
            err = SID_ERROR_NONE;
        }
        else
        {
            err = SID_ERROR_INVALID_STATE;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_resume function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static sid_error_t _ble_adapter_user_virt_dev_update_char(const sid_ble_ext_virtual_device_id_t virt_dev_id, const sid_ble_cfg_uuid_info_t * const char_uuid, const uint8_t * const data, const uint32_t data_length, uint8_t notify)
{
    sid_error_t err;
    tBleStatus  ble_ret;
    uint32_t    ll_lock_acquired;

    SID_BLE_USER_LOG_DEBUG("==>> Start ble_adapter_user_virt_dev_update_char function");

    /* Acquire BLE LL lock */
    ll_lock_acquired = _ble_adapter_user_acquire_ll_lock("Failed to acquire BLE LL mutex, race conditions are possible");

    do
    {
        if ((NULL == char_uuid) || (NULL == data) || (0u == data_length))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        sid_pal_enter_critical_region();

        /* Check if the user part is initialized at all */
        if (sid_ble_user_mode_ctx.state != SPBUM_STATE_INITIALIZED)
        {
            err = SID_ERROR_INVALID_STATE;
            sid_pal_exit_critical_region();
            break;
        }

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Ensure the device is a Peripheral */
        if (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            err = SID_ERROR_NOSUPPORT;
            sid_pal_exit_critical_region();
            break;
        }

        /* Search characteristic context by UUID */
        sid_ble_ext_gatt_server_svc_ctx_t * svc_ctx;
        sid_ble_ext_gatt_server_char_ctx_t * char_ctx;
        _ble_adapter_user_search_char_ctx_by_uuid(associated_node->ctx, char_uuid, &svc_ctx, &char_ctx);

        if ((NULL == svc_ctx) || (NULL == char_ctx))
        {
            err = SID_ERROR_NOT_FOUND;
            sid_pal_exit_critical_region();
            break;
        }

        /* Done with critical stuff */
        sid_pal_exit_critical_region();

        /* Use aci_gatt_update_char_value_ext() instead of aci_gatt_update_char_value() to support MTU sizes greater than 251 bytes */
        if (data_length <= SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT)
        {
            ble_ret = aci_gatt_update_char_value_ext(0x0000u, /* Notify all connections if enabled */
                                                     svc_ctx->handle,
                                                     char_ctx->handle,
                                                     (notify != FALSE) ? SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_NOTIFY : SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_DO_NOT_NOTIFY,
                                                     (uint16_t)data_length,
                                                     0u, /* value offset */
                                                     (uint8_t)data_length,
                                                     data);
        }
        else
        {
            /* Use several subsequent calls to pass all the data to BLE stack. Since maximum MTU size is 512 bytes we may need up to 3 calls */
            SID_BLE_USER_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - sending out   long data (%u bytes)", length);

            uint32_t remaining_data_size = data_length;
            uint32_t current_offset = 0u;

            while (remaining_data_size > SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT)
            {
                /* First call just pushes the data but does not trigger the actual value change notification */
                ble_ret = aci_gatt_update_char_value_ext(0x0000u, /* Notify all connections if enabled */
                                                         svc_ctx->handle,
                                                         char_ctx->handle,
                                                         SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_DO_NOT_NOTIFY,
                                                         (uint16_t)data_length, /* total length */
                                                         (uint16_t)current_offset, /* value offset */
                                                         SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT, /* size of the partial data to push */
                                                         data + current_offset);
                if (BLE_STATUS_SUCCESS == ble_ret)
                {
                    SID_BLE_USER_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - updated partial data, start offset: %u, bytes written: %u, remaining size: %u", current_offset, SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT, remaining_data_size - SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT);
                    current_offset += SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT;
                    remaining_data_size -= SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_SIZE_LIMIT;
                }
                else
                {
                    SID_BLE_USER_LOG_ERROR("==>> aci_gatt_update_char_value_ext - fail on putting partial data, start offset: %u, total length: %u, result: 0x%02X", current_offset, length, ble_ret);
                    break;
                }
            }

