stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
            if (BLE_STATUS_SUCCESS == ble_ret)
            {
                /* The last call uploads the rest of the data and triggers BLE notification indication */
                ble_ret = aci_gatt_update_char_value_ext(0x0000u, /* Notify all connections if enabled */
                                                         svc_ctx->handle,
                                                         char_ctx->handle,
                                                         (notify != FALSE) ? SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_NOTIFY : SID_STM32_BLE_ACI_CHARACTERISTIC_VALUE_UPDATE_TYPE_DO_NOT_NOTIFY,
                                                         (uint16_t)data_length, /* total length */
                                                         (uint16_t)current_offset, /* value offset */
                                                         (uint8_t)remaining_data_size, /* size of the remaining partial data to push */
                                                         data + current_offset);
            }
        }

        if (BLE_STATUS_SUCCESS == ble_ret)
        {
            SID_BLE_USER_LOG_DEBUG("==>> aci_gatt_update_char_value_ext - success, %u bytes written", length);
            err = SID_ERROR_NONE;
        }
        else if (BLE_STATUS_INSUFFICIENT_RESOURCES == ble_ret)
        {
            SID_BLE_USER_LOG_WARNING("==>> aci_gatt_update_char_value_ext - recoverable failure, insufficient resources");
            err = SID_ERROR_BUSY;
        }
        else
        {
            SID_BLE_USER_LOG_ERROR("==>> aci_gatt_update_char_value_ext - fail, result: 0x%02X", ble_ret);
            err = SID_ERROR_IO_ERROR;
        }
    } while (0);

    /* Release LL lock */
    (void)_ble_adapter_user_release_ll_lock(ll_lock_acquired, "Failed to release BLE LL mutex. BLE stack will be blocked till reset");

    SID_BLE_USER_LOG_DEBUG("==>> End ble_adapter_user_virt_dev_update_char function");

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_platform_init(void)
{
    sid_error_t err;

    do
    {
        /* Create semaphore to manage flash write and erase operations */
        if (NULL == ble_adapter_user_fm_semaphore)
        {
            ble_adapter_user_fm_semaphore = osSemaphoreNew(1u, 0u, &ble_adapter_user_fm_semaphore_attributes);
            if (NULL == ble_adapter_user_fm_semaphore)
            {
                err = SID_ERROR_OOM;
                break;
            }
        }

        /* Configure callback */
        ble_adapter_user_fm_callback_node.Callback = _ble_adapter_user_fm_callback;

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_adv_timeout(const sid_ble_ext_virtual_device_id_t virt_dev_id)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        sid_ble_ext_adv_state_change_t adv_notify_event;

        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node(virt_dev_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Get advertising parameters */
        const sid_ble_ext_adv_param_t * adv_param;
        switch (associated_node->ctx->device_cfg->device_type)
        {
            case SBEVDR_BLE_PERIPHERAL:
                adv_param = associated_node->ctx->device_cfg->peripheral_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            case SBEVDR_BLE_BROADCASTER:
                adv_param = associated_node->ctx->device_cfg->broadcaster_cfg.adv_param;
                err = SID_ERROR_NONE;
                break;

            default:
                err = SID_ERROR_NOSUPPORT;
                break;
        }

        /* This virtual device is not capable of advertising */
        if (err != SID_ERROR_NONE)
        {
            sid_pal_exit_critical_region();
            break;
        }

        /* Check if restart is needed */
        if ((SBEVD_STATE_ADV_FAST == associated_node->ctx->state) && (adv_param->slow_enabled != FALSE))
        {
            /* Fast advertisement timed out and slow advertisement is allowed - proceed with slow advertisement */

            /* Indicate the advertisement is stopped in case restart will fail */
            if ((associated_node->ctx->state & SBEVD_STATE_CONNECTED) != 0u)
            {
                /* Device was connected during advertisement -> clear adv bits and keep Connected status */
                associated_node->ctx->state &= ~(SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW);
            }
            else
            {
                /* No connections were present, now the node is idle */
                associated_node->ctx->state = SBEVD_STATE_IDLE;
            }

            /* Update advertisement duration */
            const uint32_t adv_duration = adv_param->slow_timeout;

            /* Apply advertisement parameters for slow advertisement */
            err = _ble_adapter_user_set_adv_params(associated_node->ctx, adv_param->slow_interval_min, adv_param->slow_interval_max);
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by _ble_adapter_sidewalk_set_adv_params() */
                break;
            }

            /* Build advertising set descriptor for HCI interface */
            Adv_Set_t hci_adv_set = {
                .Advertising_Handle              = associated_node->ctx->device_cfg->device_id,
                .Duration                        = adv_duration,
                .Max_Extended_Advertising_Events = 0u,
            };

            /* Restart advertisement */
            err = sid_stm32wba_ble_adapter_prv_generic_start_advertisement(&hci_adv_set);
            if (err != SID_ERROR_NONE)
            {
                /* Logs provided by sid_stm32wba_ble_adapter_prv_generic_start_advertisement */
                break;
            }

            /* Indicate that we are advertising */
            if (SBEVD_STATE_IDLE == associated_node->ctx->state)
            {
                associated_node->ctx->state = SBEVD_STATE_ADV_SLOW;
            }
            else
            {
                /* Keep Connected bit and add Adv Slow bit */
                associated_node->ctx->state |= SBEVD_STATE_ADV_SLOW;
            }
            adv_notify_event = SBEASC_ADV_SWITCHED_FAST_TO_SLOW;
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) switched advertisement to slow mode",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id);
        }
        else
        {
            /* No more advertisements - final timeout */
            if ((associated_node->ctx->state & SBEVD_STATE_CONNECTED) != 0u)
            {
                /* Device was connected during advertisement -> clear adv bits and keep Connected status */
                associated_node->ctx->state &= ~(SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW);
            }
            else
            {
                /* No connections were present, now the node is idle */
                associated_node->ctx->state = SBEVD_STATE_IDLE;
            }
            adv_notify_event = SBEASC_ADV_SWITCHED_TERMINATED_BY_TIMEOUT;
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X) terminated advertisement due to timeout",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id);
        }

        /* Call user callback for advertising state change event */
        sid_ble_ext_on_adv_state_changed_cb_t on_adv_state_changed;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_adv_state_changed;
        }
        else if (SBEVDR_BLE_BROADCASTER == associated_node->ctx->device_cfg->device_type)
        {
            on_adv_state_changed = associated_node->ctx->device_cfg->broadcaster_cfg.callbacks.on_adv_state_changed;
        }
        else
        {
            on_adv_state_changed = NULL;
        }

        if (on_adv_state_changed != NULL)
        {
            on_adv_state_changed(associated_node->ctx, adv_notify_event);
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

