stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_ble_connected_to_central(const sid_ble_ext_virtual_device_id_t virt_dev_id, sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;
    sid_ble_ext_conn_list_node_t * user_conn_ctx_node = NULL;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node =
#if (SID_STM32_BLE_EXTENDED_ADV_SUPPORTED == 0u)
                                                                    _ble_adapter_user_search_first_node_by_type(SBEVDR_BLE_PERIPHERAL);
#else
                                                                    _ble_adapter_user_search_device_node(virt_dev_id);
#endif /* SID_STM32_BLE_EXTENDED_ADV_SUPPORTED */

        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Check we can accept this connection */
        sid_pal_enter_critical_region();
        {
            /* Check if the virtual device state is ok */
            if ((associated_node->ctx->state < SBEVD_STATE_IDLE) || (associated_node->ctx->state >= SBEVD_STATE_FATAL_ERROR))
            {
                err = SID_ERROR_INVALID_STATE;
                sid_pal_exit_critical_region();
                break;
            }

            /* Check if the limit on simultaneous connections is not exceeded */
            if (associated_node->ctx->conn_cnt >= associated_node->ctx->device_cfg->peripheral_cfg.max_conn)
            {
                SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X) can't accept connection 0x%04X. Connections limit (%u) reached",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         conn_ctx->public_ctx.conn_id,
                         associated_node->ctx->device_cfg->peripheral_cfg.max_conn);
                err = SID_ERROR_OUT_OF_RESOURCES;
                sid_pal_exit_critical_region();
                break;
            }
        }
        sid_pal_exit_critical_region();

        /* Allocate memory for the user connection context list node */
        user_conn_ctx_node = malloc(sizeof(*user_conn_ctx_node));
        if (NULL == user_conn_ctx_node)
        {
            /* No memory to store connection context */
            err = SID_ERROR_OOM;
            break;
        }
        user_conn_ctx_node->node.prev = NULL;
        user_conn_ctx_node->node.next = NULL;

        sid_pal_enter_critical_region();
        {
            /* Store connection context pointer */
            *(sid_ble_ext_connection_ctx_t **)&user_conn_ctx_node->ctx = &conn_ctx->public_ctx;
            LST_insert_head((tListNode *)&associated_node->ctx->conn_list, (tListNode *)user_conn_ctx_node);
            associated_node->ctx->conn_cnt++;

            /* Set the MTU limit specific to the virtual BLE device */
            conn_ctx->public_ctx.max_mtu_size = associated_node->ctx->device_cfg->peripheral_cfg.max_att_mtu;

            /* Update logical state - set Connection flag and clear Advertising flags since advertising is terminated automatically upon a successful connection */
            associated_node->ctx->state |= SBEVD_STATE_CONNECTED;
            associated_node->ctx->state &= ~(SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW);

            /* Enable authorization for the connection */
            ble_status = aci_gap_set_authorization_requirement(conn_ctx->public_ctx.conn_id, 0x01u);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_BLE_USER_LOG_ERROR("aci_gap_set_authorization_requirement - fail, result: 0x%02X", ble_status);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_BLE_USER_LOG_DEBUG("==>> aci_gap_set_authorization_requirement - Success");
        }
        sid_pal_exit_critical_region();

        /* Notify user about the established connection */
        if (associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_connected != NULL)
        {
            associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_connected(associated_node->ctx, &conn_ctx->public_ctx);
        }

        /* Notify user about the initial MTU size (23 bytes) */
        if (associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_mtu_changed != NULL)
        {
            associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_mtu_changed(associated_node->ctx, &conn_ctx->public_ctx);
        }

#if SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED && SID_STM32_BLE_AUTO_NEGOTIATE_MTU_SIZE
        /* Exchange peripheral config to negotiate Sidewalk-specific MTU size */
        ble_status = aci_gatt_exchange_config(conn_ctx->public_ctx.conn_id);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("aci_gatt_exchange_config - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> aci_gatt_exchange_config - Success");
#else
        /* This command is not supported by the peripheral-only version of the stack */
#endif /* SID_STM32_BLE_GATT_EXCHANGE_CONFIG_SUPPORTED && SID_STM32_BLE_AUTO_NEGOTIATE_MTU_SIZE */

#if SID_STM32_BLE_AUTO_NEGOTIATE_CONN_PARAMS
        /* Update connection parameters */
        if (associated_node->ctx->device_cfg->peripheral_cfg.conn_param != NULL)
        {
            const sid_ble_cfg_conn_param_t * const preferred_conn_param = associated_node->ctx->device_cfg->peripheral_cfg.conn_param;
            ble_status = aci_l2cap_connection_parameter_update_req(
                                                               conn_ctx->public_ctx.conn_id,
                                                               preferred_conn_param->min_conn_interval,
                                                               preferred_conn_param->min_conn_interval,
                                                               preferred_conn_param->slave_latency,
                                                               preferred_conn_param->conn_sup_timeout);
            if (ble_status != BLE_STATUS_SUCCESS)
            {
                SID_BLE_USER_LOG_ERROR("aci_l2cap_connection_parameter_update_req - fail, result: 0x%02X", ble_status);
                err = SID_ERROR_IO_ERROR;
                break;
            }
            SID_BLE_USER_LOG_DEBUG("==>> aci_l2cap_connection_parameter_update_req - Success");
        }
#endif /* SID_STM32_BLE_AUTO_NEGOTIATE_CONN_PARAMS */

#if SID_STM32_BLE_DLE_ENABLE && SID_STM32_BLE_AUTO_NEGOTIATE_DLE_PARAMS
        /* Enable data length extensions (DLE) for Sidewalk link */
        ble_status = hci_le_set_data_length(conn_ctx->public_ctx.conn_id, SID_STM32_BLE_DLE_MAX_TX_OCTETS, SID_STM32_BLE_DLE_MAX_TX_TIME_US);
        if (ble_status != BLE_STATUS_SUCCESS)
        {
            SID_BLE_USER_LOG_ERROR("hci_le_set_data_length - fail, result: 0x%02X", ble_status);
            err = SID_ERROR_IO_ERROR;
            break;
        }
        SID_BLE_USER_LOG_DEBUG("==>> hci_le_set_data_length - Success");
#endif /* SID_STM32_BLE_DLE_ENABLE && SID_STM32_BLE_AUTO_NEGOTIATE_DLE_PARAMS */

        /* Schedule automatic advertisement restart if needed. No need to check here if the node is advertising already because advertising is terminated on connection establishment */
        if (associated_node->ctx->device_cfg->peripheral_cfg.adv_param->auto_restart != FALSE)
        {
            err = _ble_adapter_user_node_start_advertisement(associated_node, associated_node->ctx->device_cfg->peripheral_cfg.adv_param);
            if ((err != SID_ERROR_NONE) && (err != SID_ERROR_BUSY))
            {
                SID_PAL_LOG_ERROR("Failed to automatically restart advertising for virtual BLE device \"%s\" (0x%02X). Error %d",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         (int32_t)err);
            }
        }
        else
        {
            /* Notify user about the advertising termination */
            if (associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_adv_state_changed != NULL)
            {
                associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_adv_state_changed(associated_node->ctx, SBEASC_ADV_SWITCHED_TERMINATED_BY_CONNECTION);
            }
        }

        /* Done */
        SID_PAL_LOG_INFO("Connection (0x%04X) established with the Virtual BLE device \"%s\" (0x%02X). Total connections: %u",
                         conn_ctx->public_ctx.conn_id,
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         associated_node->ctx->conn_cnt);
        err = SID_ERROR_NONE;
    } while (0);

    if ((err != SID_ERROR_NONE) && (user_conn_ctx_node != NULL))
    {
        if ((user_conn_ctx_node->node.prev != NULL) && (user_conn_ctx_node->node.next != NULL))
        {
            LST_remove_node((tListNode *)user_conn_ctx_node);
        }
        free(user_conn_ctx_node);
    }

