stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_ble_connected_to_peripheral(sid_pal_ble_prv_connection_ctx_t * const conn_ctx)
{
    sid_error_t err = SID_ERROR_NOSUPPORT;

    //TODO: implement support for BLE Central role

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_ble_disconnected(const uint16_t conn_id, const uint8_t reason)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        sid_pal_enter_critical_region();
        {
            /* Remove connection from the list */
            LST_remove_node((tListNode *)conn_node);

            /* Update active connections counter */
            if (associated_node->ctx->conn_cnt > 0u)
            {
                associated_node->ctx->conn_cnt--;
            }

            /* Update device state */
            if ((0u == associated_node->ctx->conn_cnt) && (associated_node->ctx->state < SBEVD_STATE_FATAL_ERROR) && (associated_node->ctx->state >= SBEVD_STATE_IDLE))
            {
                if ((associated_node->ctx->state & (SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW)) == 0u)
                {
                    /* Device was not advertising, now it's in Idle state */
                    associated_node->ctx->state = SBEVD_STATE_IDLE;
                }
                else
                {
                    /* Device is currently advertising -> just clear Connected bit and keep adv bits in place */
                    associated_node->ctx->state &= ~SBEVD_STATE_CONNECTED;
                }
            }
            else
            {
                /* Nothing to do - the node is still connected to some other device(s) */
            }
        }
        sid_pal_exit_critical_region();

        /* Notify user about the terminated connection */
        sid_ble_ext_on_disconnected_cb_t on_disconnected;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_disconnected = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_disconnected;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_disconnected = associated_node->ctx->device_cfg->central_cfg.callbacks.on_disconnected;
        }
        else
        {
            on_disconnected = NULL;
        }

        if ((on_disconnected != NULL) && (associated_node->ctx->state < SBEVD_STATE_FATAL_ERROR))
        {
            on_disconnected(associated_node->ctx, conn_node->ctx);
        }

        /* Deallocate memory for the connection context node */
        free(conn_node);

        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X terminated (reason 0x%02X). Remaining active connections: %u",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         conn_id,
                         reason,
                         associated_node->ctx->conn_cnt);

        /* If advertisement autorestart is enabled and the node is not advertising already - resume advertising */
        if ((SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type) && (associated_node->ctx->device_cfg->peripheral_cfg.adv_param->auto_restart != FALSE)
          && ((associated_node->ctx->state < SBEVD_STATE_FATAL_ERROR)  && (associated_node->ctx->state >= SBEVD_STATE_IDLE))
          && ((associated_node->ctx->state & (SBEVD_STATE_ADV_FAST | SBEVD_STATE_ADV_SLOW)) == 0u))
        {
            /* Restart advertising for the node */
            err = _ble_adapter_user_node_start_advertisement(associated_node, associated_node->ctx->device_cfg->peripheral_cfg.adv_param);
            if (err != SID_ERROR_NONE)
            {
                SID_PAL_LOG_ERROR("Failed to automatically restart advertising for virtual BLE device \"%s\" (0x%02X). Error %d",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         (int32_t)err);
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_ble_mtu_changed(const uint16_t conn_id)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify user about the terminated connection */
        sid_ble_ext_on_mtu_changed_cb_t on_mtu_changed;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_mtu_changed = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_mtu_changed;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_mtu_changed = associated_node->ctx->device_cfg->central_cfg.callbacks.on_mtu_changed;
        }
        else
        {
            on_mtu_changed = NULL;
        }

        if (on_mtu_changed != NULL)
        {
            on_mtu_changed(associated_node->ctx, conn_node->ctx);
        }

        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: MTU changed to %u bytes",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         conn_id,
                         conn_node->ctx->mtu_size);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

