stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_conn_param_changed(const uint16_t conn_id)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify user about the connection parameters update */
        sid_ble_ext_on_conn_param_changed_cb_t on_conn_param_changed;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_conn_param_changed = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_conn_param_changed;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_conn_param_changed = associated_node->ctx->device_cfg->central_cfg.callbacks.on_conn_param_changed;
        }
        else
        {
            on_conn_param_changed = NULL;
        }

        if (on_conn_param_changed != NULL)
        {
            on_conn_param_changed(associated_node->ctx, conn_node->ctx);
        }

        SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: connection parameters updated:",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         conn_id);
        SID_PAL_LOG_INFO("     - Connection Interval: %u ms", (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(conn_node->ctx->conn_interval));
        SID_PAL_LOG_INFO("     - Connection latency:  %u",    conn_node->ctx->conn_latency);
        SID_PAL_LOG_INFO("     - Supervision Timeout: %u ms", SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(conn_node->ctx->supervision_timeout));

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_conn_params_update_req(const uint16_t conn_id, const sid_ble_ext_proposed_conn_params_t * const proposed_params,
                                                                                              sid_ble_ext_accepted_conn_params_t * const out_accepted_params, tBleStatus * const out_le_resp_code)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify user about the connection parameters update request */
        sid_ble_ext_on_conn_param_update_req_cb_t on_conn_param_update_req;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_conn_param_update_req = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_conn_param_update_req;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_conn_param_update_req = associated_node->ctx->device_cfg->central_cfg.callbacks.on_conn_param_update_req;
        }
        else
        {
            /* Invalid device type - only peripherals and centrals can handle this event */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        if (on_conn_param_update_req != NULL)
        {
            /* Call device-speicifc handler */
            on_conn_param_update_req(associated_node->ctx, conn_node->ctx, proposed_params, out_accepted_params, out_le_resp_code);
        }
        else
        {
            /* Use generic handler */
            const sid_ble_ext_conn_params_limits_t generic_limits ={
                .interval_min       = SID_BLE_HCI_CONN_INTERVAL_LOWER_LIMIT,
                .interval_max       = SID_BLE_HCI_CONN_INTERVAL_UPPER_LIMIT,
                .latency_max        = SID_BLE_HCI_CONN_LATENCY_UPPER_LIMIT,
                .reasonable_timeout = SID_STM32_BLE_REASONABLE_CONN_TIMEOUT,
                .ce_length_min      = SID_BLE_HCI_CONN_EVENT_LENGTH_LOWER_LIMIT,
                .ce_length_max      = SID_BLE_HCI_CONN_EVENT_LENGTH_UPPER_LIMIT,
            };

            err = sid_stm32wba_ble_adapter_util_validate_proposed_conn_params(proposed_params, &generic_limits, out_accepted_params, out_le_resp_code);
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }

        if (BLE_STATUS_SUCCESS == *out_le_resp_code)
        {
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: connection parameters update request accepted:",
                             associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                             associated_node->ctx->device_cfg->device_id,
                             conn_id);
            SID_PAL_LOG_INFO("     - Connection Interval Min: %u ms", (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(out_accepted_params->interval_min));
            SID_PAL_LOG_INFO("     - Connection Interval Max: %u ms", (uint32_t)SID_STM32_BLE_CONN_INTERVAL_UNITS_TO_MS(out_accepted_params->interval_max));
            SID_PAL_LOG_INFO("     - Connection latency:      %u",    out_accepted_params->latency_max);
            SID_PAL_LOG_INFO("     - Supervision Timeout:     %u ms", SID_STM32_BLE_CONN_SUPERVISION_UNITS_TO_MS(out_accepted_params->timeout));
        }
        else
        {
             SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: connection parameters update request rejected, status 0x%02X",
                associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                associated_node->ctx->device_cfg->device_id,
                conn_id,
                *out_le_resp_code
            );
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

