stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_encryption_changed(const uint16_t conn_id)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify user about the encryption state update */
        sid_ble_ext_on_encryption_changed_cb_t on_encryption_changed;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_encryption_changed = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_encryption_changed;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_encryption_changed = associated_node->ctx->device_cfg->central_cfg.callbacks.on_encryption_changed;
        }
        else
        {
            on_encryption_changed = NULL;
        }

        if (on_encryption_changed != NULL)
        {
            on_encryption_changed(associated_node->ctx, conn_node->ctx);
        }

        if (FALSE == conn_node->ctx->is_secure)
        {
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: encryption disabled",
                             associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                             associated_node->ctx->device_cfg->device_id,
                             conn_id);
        }
        else
        {
            uint8_t security_mode = 0u;
            uint8_t security_level = 0u;

            (void)aci_gap_get_security_level(conn_id, &security_mode, &security_level);

            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: encryption enabled: mode %u, level %u",
                         associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                         associated_node->ctx->device_cfg->device_id,
                         conn_id,
                         security_mode, security_level);
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_pairing_keypress_notification(const uint16_t conn_id, const uint8_t notification_type)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify user about the keypress event */
        sid_ble_ext_on_pairing_keypress_notification_cb_t on_pairing_keypress_notification;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_keypress_notification = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_pairing_keypress_notification;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_keypress_notification = associated_node->ctx->device_cfg->central_cfg.callbacks.on_pairing_keypress_notification;
        }
        else
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        if (on_pairing_keypress_notification != NULL)
        {
            on_pairing_keypress_notification(associated_node->ctx, conn_node->ctx, notification_type);
        }

        SID_BLE_USER_LOG_DEBUG("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: keypress notification 0x%02X",
                               associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                               associated_node->ctx->device_cfg->device_id,
                               conn_id,
                               notification_type);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_pairing_pass_key_request(const uint16_t conn_id, uint32_t * const out_passkey)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Request the user to generate a passkey */
        sid_ble_ext_on_pairing_pass_key_request_cb_t on_pairing_pass_key_request;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_pass_key_request = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_pairing_pass_key_request;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_pass_key_request = associated_node->ctx->device_cfg->central_cfg.callbacks.on_pairing_pass_key_request;
        }
        else
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        if (on_pairing_pass_key_request != NULL)
        {
            on_pairing_pass_key_request(associated_node->ctx, conn_node->ctx, out_passkey);
        }
        else
        {
            /* Reject the request since there's no user-defined method to generate and display the passkey */
            SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X) - passkey callback is null, pairing aborted",
                               associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                               associated_node->ctx->device_cfg->device_id);
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        /* Check the passkey is in the valid range */
        if (*out_passkey > 999999u)
        {
            SID_PAL_LOG_ERROR("Passkey %u is invalid - it should not exceed 6 digits", *out_passkey);
            err = SID_ERROR_INVALID_RESPONSE;
            break;
        }

        SID_BLE_USER_LOG_DEBUG("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: passkey set to %06u",
                               associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                               associated_node->ctx->device_cfg->device_id,
                               conn_id,
                               *out_passkey);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

