stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_pairing_numeric_comparison_value(const uint16_t conn_id, const uint32_t numeric_value, uint32_t * const out_numeric_value_matches)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Send the numeric comparison value to the user */
        sid_ble_ext_on_pairing_numeric_comparison_value_cb_t on_pairing_numeric_comparison_value;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_numeric_comparison_value = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_pairing_numeric_comparison_value;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_numeric_comparison_value = associated_node->ctx->device_cfg->central_cfg.callbacks.on_pairing_numeric_comparison_value;
        }
        else
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        if (on_pairing_numeric_comparison_value != NULL)
        {
            on_pairing_numeric_comparison_value(associated_node->ctx, conn_node->ctx, numeric_value, out_numeric_value_matches);
        }
        else
        {
            /* Reject the request since there's no user-defined method to generate and display the passkey */
            SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X) - numeric comparison callback is null, pairing aborted",
                               associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                               associated_node->ctx->device_cfg->device_id);
            err = SID_ERROR_NOSUPPORT;
            break;
        }

        SID_BLE_USER_LOG_DEBUG("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: numeric comparison is %s",
                               associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                               associated_node->ctx->device_cfg->device_id,
                               conn_id,
                               *out_numeric_value_matches != FALSE ? "ok" : "rejected");

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_pairing_complete(const uint16_t conn_id, tBleStatus status, uint8_t reason)
{
    sid_error_t err = SID_ERROR_GENERIC;
    tBleStatus ble_status;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if ((associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL) && (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_CENTRAL))
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Check if the peer is bonded */
        uint8_t peer_identity_addr_type;
        switch (conn_node->ctx->peer_addr_type)
        {
            case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC:
            case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RPA_PUBLIC_IDENTITY:
                peer_identity_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_PUBLIC;
                break;

            case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM:
            case SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RPA_RANDOM_IDENTITY:
            default:
                peer_identity_addr_type = SID_BLE_HCI_ADV_PEER_ADDR_TYPE_RANDOM;
                break;
        }

        uint8_t resolved_peer_addr_type;
        uint8_t resolved_peer_address[6];
        ble_status = aci_gap_check_bonded_device(peer_identity_addr_type, conn_node->ctx->peer_identity, &resolved_peer_addr_type, resolved_peer_address);
        if (BLE_STATUS_SUCCESS == ble_status)
        {
            /**
             * The peer is bonded - check the bonding belongs to the current Virtual BLE Device. This check is necessary to eliminate the possibility of pairing via Virtual Devie A and then reuse the bonding
             * for unauthorized secure connections to the Virtual Device B.
             */
            err = _ble_adapter_user_search_bond_pair_kv_record(associated_node->ctx->device_cfg->device_id, peer_identity_addr_type, conn_node->ctx->peer_identity, NULL);

            /* Check if the connection can be accepted */
            if (err != SID_ERROR_NONE)
            {
                if (SID_ERROR_NOT_FOUND == err)
                {
                    /* Identity info for the remote peer was not found in the non-volitile context of this virtual device - search in the contexts of the other virtual devices */
                    for (uint32_t i = 0u; i < sid_ble_drv_ctx.cfg->custom_profiles.num_virtual_devices; i++)
                    {
                        const sid_ble_ext_virtual_device_t * const dev = &sid_ble_drv_ctx.cfg->custom_profiles.virtual_devices[i];

                        /* Search for the other peripheral devices */
                        if ((SBEVDR_BLE_PERIPHERAL == dev->device_type) && (dev->device_id != associated_node->ctx->device_cfg->device_id))
                        {
                            sid_error_t kv_search_err = _ble_adapter_user_search_bond_pair_kv_record(dev->device_id, peer_identity_addr_type, conn_node->ctx->peer_identity, NULL);

