stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
                            if (SID_ERROR_NONE == kv_search_err)
                            {
                                /* Found current remote peer in the non-volatile context of the other Virtual BLE device */
                                SID_PAL_LOG_WARNING("Connection 0x%04X is bonded to the Virtual BLE device \"%s\" (0x%02X), not to the Virtual BLE device \"%s\" (0x%02X)",
                                                    conn_id,
                                                    dev->device_name != NULL ? dev->device_name : "<unnamed>",
                                                    dev->device_id,
                                                    associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                                    associated_node->ctx->device_cfg->device_id
                                                    );
                                err = SID_ERROR_AUTHENTICATION_FAIL;
                                break;
                            }
                        }
                    }
                }

                if (SID_ERROR_AUTHENTICATION_FAIL == err)
                {
                    /* Found current remote peer in the non-volatile context of the other Virtual BLE device - reject the connection*/
                    SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: rejected because the bonding was performed with a different Virtual BLE Device",
                                      associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                      associated_node->ctx->device_cfg->device_id,
                                      conn_id);
                }
                else if (SID_ERROR_NOT_FOUND == err)
                {
                    /* If the error is still SID_ERROR_NOT_FOUND this means the non-volatile context is not stored yet, probably that's the very first connection of this peer */
                    err = SID_ERROR_OUT_OF_RESOURCES;
                    for (uint32_t i = 0u; i < SID_STM32_BLE_BONDING_LIST_MAX_ENTRIES; i++)
                    {
                        const uint16_t bond_pair_kv_key = _ble_adapter_user_get_storage_kv_bond_pair_key(associated_node->ctx->device_cfg->device_id, (uint16_t)i);
                        uint32_t dummy_len;
                        sid_error_t free_slot_err;

                        /* Check if this slot is free */
                        free_slot_err = sid_pal_storage_kv_record_get_len(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP, bond_pair_kv_key, &dummy_len);

                        if (SID_ERROR_NOT_FOUND == free_slot_err)
                        {
                            /* Slot is free, store the record here */
                            sid_pal_ble_ext_peer_identity_addr_t kv_bond_pair = {
                                .identity_address_type = peer_identity_addr_type,
                            };
                            SID_STM32_UTIL_fast_memcpy(kv_bond_pair.identity_address, conn_node->ctx->peer_identity, sizeof(kv_bond_pair.identity_address));

                            /* Store non-volatile context */
                            err = sid_pal_storage_kv_record_set(STORAGE_KV_SID_BLE_ADAPTER_BOND_PAIR_GROUP, bond_pair_kv_key, &kv_bond_pair, sizeof(kv_bond_pair));
                            if (err != SID_ERROR_NONE)
                            {
                                /* Connection security can be reduced due to that */
                                SID_PAL_LOG_ERROR("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: failed to store non-volatile bonding context. Error %d",
                                                  associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                                  associated_node->ctx->device_cfg->device_id,
                                                  conn_id,
                                                  (int32_t)err);
                            }
                            else
                            {
                                SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: stored non-volatile bonding context",
                                                  associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                                  associated_node->ctx->device_cfg->device_id,
                                                  conn_id);
                            }

                            /* Successfull or not, terminate the loop */
                            break;
                        }
                    }
                }
                else
                {
                    /* Nothing to do here */
                }

                /* If there's still an error at this point there's nothing more we can do */
                if (err != SID_ERROR_NONE)
                {
                    /* Terminate the connection */
                    ble_status = aci_gap_terminate(conn_id, SID_BLE_HCI_STATUS_REMOTE_SIDE_TERMINATED);
                    if (ble_status != BLE_STATUS_SUCCESS)
                    {
                        SID_PAL_LOG_ERROR("Failed to terminate BLE connection 0x%04X. Error 0x%02X. Virtual BLE device \"%s\" (0x%02X) is blocked for security reasons",
                                          conn_id,
                                          ble_status,
                                          associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                          associated_node->ctx->device_cfg->device_id);

                        /* Lock the virtual device to prevent unauthenticated access */
                        associated_node->ctx->state = SBEVD_STATE_FATAL_ERROR;
                    }

                    /* Report back no error, otherwise the generic pairing error handler will erase the bond */
                    err = SID_ERROR_NONE;

                    /* Something went wrong - abort further processing */
                    break;
                }
            }
        }
        else
        {
            /* The device is not bonded, meaning the pairing was performed from scratch - not further actions needed since it's techinically impossible to reuse the generated keys for the other connections */
        }

        /* Notify the user about the pairing outcomes */
        sid_ble_ext_on_pairing_complete_cb_t on_pairing_complete;
        if (SBEVDR_BLE_PERIPHERAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_complete = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_pairing_complete;
        }
        else if (SBEVDR_BLE_CENTRAL == associated_node->ctx->device_cfg->device_type)
        {
            on_pairing_complete = associated_node->ctx->device_cfg->central_cfg.callbacks.on_pairing_complete;
        }
        else
        {
            err = SID_ERROR_INVALID_STATE;
            break;
        }

        if (on_pairing_complete != NULL)
        {
            on_pairing_complete(associated_node->ctx, conn_node->ctx, status, reason);
        }

        if (SID_BLE_HCI_STATUS_SUCCESS == status)
        {
            SID_PAL_LOG_INFO("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: pairing succeeded",
                             associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                             associated_node->ctx->device_cfg->device_id,
                             conn_id);
        }
        else
        {
            SID_PAL_LOG_WARNING("Virtual BLE device \"%s\" (0x%02X), connection 0x%04X: pairing rejected with status 0x%02X, reason 0x%02X",
                                associated_node->ctx->device_cfg->device_name != NULL ? associated_node->ctx->device_cfg->device_name : "<unnamed>",
                                associated_node->ctx->device_cfg->device_id,
                                conn_id,
                                status,
                                reason);
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

