stm32-hotspot/STM32-Sidewalk-SDK/pal/st/stm32wba/sid_pal/ble_adapter/sid_pal_ble_adapter_stm32wba_user_gap_gatt.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_stm32wba_ble_adapter_user_on_authorization_req(const uint16_t conn_id)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        /* Locate associated node in the list of the active devices */
        sid_ble_ext_virtual_device_node_t * const associated_node = _ble_adapter_user_search_device_node_by_conn_handle(conn_id);
        if (NULL == associated_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        if (associated_node->ctx->device_cfg->device_type != SBEVDR_BLE_PERIPHERAL)
        {
            /* Should not be possible, but just in case */
            err = SID_ERROR_NO_PERMISSION;
            break;
        }

        /* Locate connection context */
        sid_ble_ext_conn_list_node_t * const conn_node = _ble_adapter_user_search_connection_node_by_conn_handle(associated_node->ctx, conn_id);
        if (NULL == conn_node)
        {
            err = SID_ERROR_NOT_FOUND;
            break;
        }

        /* Notify the user about the pairing outcomes */
        if (associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_authorization_req != NULL)
        {
            err = associated_node->ctx->device_cfg->peripheral_cfg.callbacks.on_authorization_req(associated_node->ctx, conn_node->ctx);
        }
        else
        {
            /* No user-defined callback exists, grant authorization by default */
            err = SID_ERROR_NONE;
        }

        /* Done */
    } while (0);

    return err;
}

/* Global function definitions -----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_ble_adapter_ext_create_extended_ifc(const sid_pal_ble_adapter_extended_interface_t * * const ext_ifc_handle)
{
    sid_error_t err = SID_ERROR_GENERIC;

    do
    {
        if (NULL == ext_ifc_handle)
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

#if (SID_STM32_BLE_COEXISTENCE_MODE != SID_STM32_BLE_COEXISTENCE_MODE_NONE) && (SID_STM32_BLE_COEXISTENCE_MODE != SID_STM32_BLE_COEXISTENCE_MODE_ROUTE_NON_SID)
        *ext_ifc_handle = &user_ble_ifc;
        err = SID_ERROR_NONE;
#else
        SID_PAL_LOG_ERROR("User-defined BLE profiles are not supported by the current config");
        *ext_ifc_handle = NULL;
        err = SID_ERROR_NOSUPPORT;
#endif /* SID_STM32_BLE_COEXISTENCE_MODE_NONE */

    } while (0);

    return err;
}
